[Killed] ConditionalExpression
main/components/Modal/ReviewModeratorModal.jsx:10:9
 
   const handleSubmit = (e) => {
     e.preventDefault();
-    if (status === "APPROVED" || status === "REJECTED") {
+    if (false || status === "REJECTED") {
       onSubmit({ status, moderatorComment });
     }
killedBy: ReviewModeratorModal tests calls onSubmit with status APPROVED and moderatorComment
statusReason: expected "vi.fn()" to be called with arguments: [ { status: 'APPROVED', …(1) } ]

Number of calls: 0
