[Killed] BlockStatement
main/components/Reviews/ReviewsTable.jsx:74:39
   };
 
   const handleSubmit = ({ moderatorComment }) => {
-    if (pendingStatus === "APPROVED") {
-      approveMutation.mutate({
-        cell: pendingCell,
-        moderatorComments: moderatorComment,
-      });
-    } else {
+    if (pendingStatus === "APPROVED") {} else {
       rejectMutation.mutate({
         cell: pendingCell,
killedBy: ReviewsTable tests handleSubmit sends correct payload for approve
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class=""
    style=""
