[Killed] OptionalChaining
main/components/Nav/AppNavbar.jsx:40:14
               <Nav.Link href="/h2-console">H2Console</Nav.Link>
             )}
 
-            {systemInfo?.showSwaggerUILink && (
+            {systemInfo.showSwaggerUILink && (
               <Nav.Link href="/swagger-ui/index.html">Swagger</Nav.Link>
             )}
killedBy: AppNavbar tests renders correctly for regular logged in user
statusReason: Cannot read properties of undefined (reading 'showSwaggerUILink')

[Killed] LogicalOperator
main/components/Nav/AppNavbar.jsx:51:16
 
           <Navbar.Collapse className="justify-content-between">
             <Nav className="mr-auto">
-              {hasRole(currentUser, "ROLE_ADMIN") && (
-                <NavDropdown
-                  title="Admin"
-                  id="appnavbar-admin-dropdown"
-                  data-testid="appnavbar-admin-dropdown"
-                >
-                  <NavDropdown.Item as={Link} to="/admin/admins">
-                    Admins
-                  </NavDropdown.Item>
-                  <NavDropdown.Item as={Link} to="/admin/moderators">
-                    Moderators
-                  </NavDropdown.Item>
-                  <NavDropdown.Item as={Link} to="/admin/developer">
-                    Developer Info
-                  </NavDropdown.Item>
-                </NavDropdown>
-              )}
+              {hasRole(currentUser, "ROLE_ADMIN") || <NavDropdown title="Admin" id="appnavbar-admin-dropdown" data-testid="appnavbar-admin-dropdown">
+                  <NavDropdown.Item as={Link} to="/admin/admins">
+                    Admins
+                  </NavDropdown.Item>
+                  <NavDropdown.Item as={Link} to="/admin/moderators">
+                    Moderators
+                  </NavDropdown.Item>
+                  <NavDropdown.Item as={Link} to="/admin/developer">
+                    Developer Info
+                  </NavDropdown.Item>
+                </NavDropdown>}
 
               {(hasRole(currentUser, "ROLE_ADMIN") ||
killedBy: AppNavbar tests renders correctly for admin user
statusReason: Unable to find an element by: [data-testid="appnavbar-admin-dropdown"]

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-sm navbar-light bg-warning sticky-top"
      data-testid="AppNavbarLocalhost"

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.jsx:51:16
 
           <Navbar.Collapse className="justify-content-between">
             <Nav className="mr-auto">
-              {hasRole(currentUser, "ROLE_ADMIN") && (
-                <NavDropdown
-                  title="Admin"
-                  id="appnavbar-admin-dropdown"
-                  data-testid="appnavbar-admin-dropdown"
-                >
-                  <NavDropdown.Item as={Link} to="/admin/admins">
-                    Admins
-                  </NavDropdown.Item>
-                  <NavDropdown.Item as={Link} to="/admin/moderators">
-                    Moderators
-                  </NavDropdown.Item>
-                  <NavDropdown.Item as={Link} to="/admin/developer">
-                    Developer Info
-                  </NavDropdown.Item>
-                </NavDropdown>
-              )}
+              {false}
 
               {(hasRole(currentUser, "ROLE_ADMIN") ||
killedBy: AppNavbar tests renders correctly for admin user
statusReason: Unable to find an element by: [data-testid="appnavbar-admin-dropdown"]

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-sm navbar-light bg-warning sticky-top"
      data-testid="AppNavbarLocalhost"

[Killed] LogicalOperator
main/components/Nav/AppNavbar.jsx:69:16
                 </NavDropdown>
               )}
 
-              {(hasRole(currentUser, "ROLE_ADMIN") ||
-                hasRole(currentUser, "ROLE_MODERATOR")) && (
-                <NavDropdown
-                  title="Moderate"
-                  id="appnavbar-moderate-dropdown"
-                  data-testid="appnavbar-moderate-dropdown"
-                >
-                  <NavDropdown.Item as={Link} to="/moderate/aliases">
-                    Moderator Page
-                  </NavDropdown.Item>
-
-                  <NavDropdown.Item as={Link} to="/moderate">
-                    Moderate Reviews
-                  </NavDropdown.Item>
-                </NavDropdown>
-              )}
+              {hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_MODERATOR") || <NavDropdown title="Moderate" id="appnavbar-moderate-dropdown" data-testid="appnavbar-moderate-dropdown">
+                  <NavDropdown.Item as={Link} to="/moderate/aliases">
+                    Moderator Page
+                  </NavDropdown.Item>
+
+                  <NavDropdown.Item as={Link} to="/moderate">
+                    Moderate Reviews
+                  </NavDropdown.Item>
+                </NavDropdown>}
 
               {currentUser && currentUser.loggedIn ? (
killedBy: AppNavbar tests renders correctly for regular logged in user
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <a
  aria-expanded="false"
  class="dropdown-toggle nav-link"
  href="#"
  id="appnavbar-moderate-dropdown"
  role="button"
