[Killed] ConditionalExpression
main/pages/Reviews/EditReviewPage.jsx:44:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Review</h1>
-        {review && (
-          <ReviewForm
-            initialContents={{
-              ...review,
-              itemStars: review.itemsStars,
-              itemName: review.item?.name,
-            }}
-            initialItemName={review.item?.name}
-            submitAction={(data) => mutation.mutate(data)}
-            buttonLabel="Update Review"
-          />
-        )}
+        {true}
       </div>
     </BasicLayout>
killedBy: EditReviewPage tests renders form pre-populated with existing review data
statusReason: Unable to find a label with the text of: /comments/i

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
