[Killed] ArrowFunction
main/pages/Admin/AdminsIndexPage.jsx:23:5
   );
 
   const addMutation = useBackendMutation(
-    (email) => ({
-      url: "/api/admin/post",
-      method: "POST",
-      params: { email },
-    }),
+    () => undefined,
     {
       onSuccess: (admin) => {
killedBy: AdminsIndexPage tests clicking Add Admin opens the modal, and a successful post shows a toast and closes it
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] BooleanLiteral
main/pages/Admin/AdminsIndexPage.jsx:53:21
 
   const openAddModal = () => {
     setAddServerError(null);
-    setShowAddModal(true);
+    setShowAddModal(false);
   };
 
killedBy: AdminsIndexPage tests clicking Add Admin opens the modal, and a successful post shows a toast and closes it
statusReason: Unable to find an element by: [data-testid="RoleEmailAddModal"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
