[Killed] ArrowFunction
main/pages/Admin/ModeratorsIndexPage.jsx:23:5
   );
 
   const addMutation = useBackendMutation(
-    (email) => ({
-      url: "/api/admin/moderators/post",
-      method: "POST",
-      params: { email },
-    }),
+    () => undefined,
     {
       onSuccess: (moderator) => {
killedBy: ModeratorsIndexPage tests clicking Add Moderator opens the modal, and a successful post shows a toast and closes it
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] StringLiteral
main/pages/Admin/ModeratorsIndexPage.jsx:25:15
   const addMutation = useBackendMutation(
     (email) => ({
       url: "/api/admin/moderators/post",
-      method: "POST",
+      method: "",
       params: { email },
     }),
killedBy: ModeratorsIndexPage tests clicking Add Moderator opens the modal, and a successful post shows a toast and closes it
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] ConditionalExpression
main/pages/Admin/ModeratorsIndexPage.jsx:37:11
       onError: (error) => {
         let message = "Unable to add moderator.";
         if (
-          error.response &&
-          error.response.data &&
-          error.response.data.message
+          false
         ) {
           message = error.response.data.message;
killedBy: ModeratorsIndexPage tests a failed post shows the server error inside the modal
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  newmod@ucsb.edu is already a moderator
Received:
  Unable to add moderator.

[Killed] BlockStatement
main/pages/Admin/ModeratorsIndexPage.jsx:51:30
     [getEndpoint],
   );
 
-  const openAddModal = () => {
-    setAddServerError(null);
-    setShowAddModal(true);
-  };
+  const openAddModal = () => {};
 
   const closeAddModal = () => {
killedBy: ModeratorsIndexPage tests clicking Add Moderator opens the modal, and a successful post shows a toast and closes it
statusReason: Unable to find an element by: [data-testid="RoleEmailAddModal-email"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
