[Killed] BooleanLiteral
main/pages/Admin/AdminsIndexPage.jsx:12:52
 const getEndpoint = "/api/admin/all";
 
 export default function AdminsIndexPage() {
-  const [showAddModal, setShowAddModal] = useState(false);
+  const [showAddModal, setShowAddModal] = useState(true);
   const [addServerError, setAddServerError] = useState(null);
 
killedBy: AdminsIndexPage tests renders the list of admins and the cannot-delete note
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-dialog modal-dialog-centered"
  data-testid="RoleEmailAddModal"
>
  <div
    class="modal-content"

[Killed] ObjectLiteral
main/pages/Admin/AdminsIndexPage.jsx:18:5
   const { data: admins } = useBackend(
     [getEndpoint],
     // Stryker disable next-line StringLiteral: axios treats a falsy method as "GET"
-    { method: "GET", url: getEndpoint },
+    {},
     [],
   );
killedBy: AdminsIndexPage tests renders the list of admins and the cannot-delete note
statusReason: Unable to find an element by: [data-testid="AdminsIndexPage-cell-row-0-col-email"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BooleanLiteral
main/pages/Admin/AdminsIndexPage.jsx:31:25
     {
       onSuccess: (admin) => {
         toast(`New admin added - email: ${admin.email}`);
-        setShowAddModal(false);
+        setShowAddModal(true);
         setAddServerError(null);
       },
killedBy: AdminsIndexPage tests clicking Add Admin opens the modal, and a successful post shows a toast and closes it
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-dialog modal-dialog-centered"
  data-testid="RoleEmailAddModal"
>
  <div
    class="modal-content"

[Killed] LogicalOperator
main/pages/Admin/AdminsIndexPage.jsx:37:11
       onError: (error) => {
         let message = "Unable to add admin.";
         if (
-          error.response &&
-          error.response.data &&
+          error.response || error.response.data &&
           error.response.data.message
         ) {
killedBy: AdminsIndexPage tests a response with no body at all still falls back to a default message
statusReason: Unable to find an element by: [data-testid="RoleEmailAddModal-error"]

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Killed] BooleanLiteral
main/pages/Admin/AdminsIndexPage.jsx:57:21
   };
 
   const closeAddModal = () => {
-    setShowAddModal(false);
+    setShowAddModal(true);
     setAddServerError(null);
   };
killedBy: AdminsIndexPage tests clicking Cancel in the add modal closes it without posting
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-dialog modal-dialog-centered"
  data-testid="RoleEmailAddModal"
>
  <div
    class="modal-content"

[Killed] ArrowFunction
main/pages/Admin/AdminsIndexPage.jsx:87:24
       <RoleEmailAddModal
         show={showAddModal}
         onHide={closeAddModal}
-        onSubmitEmail={(email) => addMutation.mutate(email)}
+        onSubmitEmail={() => undefined}
         title="Add Admin"
         buttonLabel="Add"
killedBy: AdminsIndexPage tests clicking Add Admin opens the modal, and a successful post shows a toast and closes it
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""
