[Killed] EqualityOperator
main/components/DiningCommons/DiningCommonsTable.jsx:25:24
       Cell: ({ value, row }) => {
         return (
           <div>
-            {!value || value.length === 0
+            {!value || value.length !== 0
               ? "No meals offered today"
               : value.map((meal) => (
killedBy: DiningCommonsTable tests Meals Offered Today renders meal links correctly when there are no meals offered
statusReason: Unable to find an element with the text: No meals offered today. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
