[Killed] ObjectLiteral
main/pages/Admin/ModeratorsIndexPage.jsx:26:15
     (email) => ({
       url: "/api/admin/moderators/post",
       method: "POST",
-      params: { email },
+      params: {},
     }),
     {
killedBy: ModeratorsIndexPage tests clicking Add Moderator opens the modal, and a successful post shows a toast and closes it
statusReason: expected {} to deeply equal { email: 'newmod@ucsb.edu' }

[Killed] StringLiteral
main/pages/Admin/ModeratorsIndexPage.jsx:35:23
         setAddServerError(null);
       },
       onError: (error) => {
-        let message = "Unable to add moderator.";
+        let message = "";
         if (
           error.response &&
killedBy: ModeratorsIndexPage tests a failed post with no message from the server falls back to a default message
statusReason: Unable to find an element by: [data-testid="RoleEmailAddModal-error"]

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Killed] LogicalOperator
main/pages/Admin/ModeratorsIndexPage.jsx:37:11
       onError: (error) => {
         let message = "Unable to add moderator.";
         if (
-          error.response &&
-          error.response.data &&
-          error.response.data.message
+          error.response && error.response.data || error.response.data.message
         ) {
           message = error.response.data.message;
killedBy: ModeratorsIndexPage tests a failed post with no message from the server falls back to a default message
statusReason: Unable to find an element by: [data-testid="RoleEmailAddModal-error"]

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Killed] BlockStatement
main/pages/Admin/ModeratorsIndexPage.jsx:40:11
           error.response &&
           error.response.data &&
           error.response.data.message
-        ) {
-          message = error.response.data.message;
-        }
+        ) {}
         setAddServerError(message);
       },
killedBy: ModeratorsIndexPage tests a failed post shows the server error inside the modal
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  newmod@ucsb.edu is already a moderator
Received:
  Unable to add moderator.

[Killed] BlockStatement
main/pages/Admin/ModeratorsIndexPage.jsx:56:31
     setShowAddModal(true);
   };
 
-  const closeAddModal = () => {
-    setShowAddModal(false);
-    setAddServerError(null);
-  };
+  const closeAddModal = () => {};
 
   return (
killedBy: ModeratorsIndexPage tests clicking Cancel in the add modal closes it without posting
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-dialog modal-dialog-centered"
  data-testid="RoleEmailAddModal"
>
  <div
    class="modal-content"
