[Killed] ObjectLiteral
main/components/Users/RoleEmailTable.jsx:45:5
       Header: "Email",
       accessor: "email", // accessor is the "key" in the data
     },
-    {
-      Header: "Delete",
-      accessor: "isInAdminEmails",
-      Cell: ({ cell }) => {
-        if (!cell.row.original.isInAdminEmails) {
-          return (
-            <Button
-              variant="danger"
-              onClick={() => deleteCallback(cell)}
-              data-testid={`${testIdPrefix}-cell-row-${cell.row.index}-col-delete-button`}
-            >
-              Delete
-            </Button>
-          );
-        }
-        return (
-          <span
-            data-testid={`${testIdPrefix}-cell-row-${cell.row.index}-cannot-delete`}
-          >
-            In <code>ADMIN_EMAILS</code>
-          </span>
-        );
-      },
-    },
+    {},
   ];
 
killedBy: RoleEmailTable renders empty table correctly when data is null
statusReason: A column ID (or string accessor) is required!

[Killed] ConditionalExpression
main/components/Users/RoleEmailTable.jsx:49:13
       Header: "Delete",
       accessor: "isInAdminEmails",
       Cell: ({ cell }) => {
-        if (!cell.row.original.isInAdminEmails) {
+        if (true) {
           return (
             <Button
killedBy: RoleEmailTable renders table with email data plus isInAdminEmails
statusReason: Unable to find an element by: [data-testid="RoleEmailTable-cell-row-0-cannot-delete"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
