[Killed] ArithmeticOperator
main/pages/Admin/UsersIndexPage.jsx:24:5
 
   const totalPages = Math.ceil(users.length / pageSize);
   const paginatedUsers = users.slice(
-    currentPage * pageSize,
+    currentPage / pageSize,
     (currentPage + 1) * pageSize,
   );
killedBy: UsersIndexPage tests paging works correctly
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <td
  data-testid="UsersTable-cell-row-0-col-email"
  role="cell"
>
  user1@ucsb.edu
</td> instead

[Killed] ArithmeticOperator
main/pages/Admin/UsersIndexPage.jsx:25:6
   const totalPages = Math.ceil(users.length / pageSize);
   const paginatedUsers = users.slice(
     currentPage * pageSize,
-    (currentPage + 1) * pageSize,
+    (currentPage - 1) * pageSize,
   );
 
killedBy: UsersIndexPage tests renders three users in the table
statusReason: Unable to find an element with the text: phtcon@ucsb.edu. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] MethodExpression
main/pages/Admin/UsersIndexPage.jsx:57:50
         <div className="d-flex align-items-center gap-2 mt-2">
           <button
             className="btn btn-outline-secondary"
-            onClick={() => setCurrentPage((p) => Math.max(p - 1, 0))}
+            onClick={() => setCurrentPage((p) => Math.min(p - 1, 0))}
             disabled={currentPage === 0}
             data-testid="UsersIndexPage-prev"
killedBy: UsersIndexPage tests prev from page 3 goes to page 2 (not page 1)
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Page 2 of 3
Received:
  Page 1 of 3

[Killed] ConditionalExpression
main/pages/Admin/UsersIndexPage.jsx:58:23
           <button
             className="btn btn-outline-secondary"
             onClick={() => setCurrentPage((p) => Math.max(p - 1, 0))}
-            disabled={currentPage === 0}
+            disabled={false}
             data-testid="UsersIndexPage-prev"
           >
killedBy: UsersIndexPage tests prev button is disabled on first page
statusReason: expect(element).toBeDisabled()

Received element is not disabled:
  <button
  class="btn btn-outline-secondary"
  data-testid="UsersIndexPage-prev"
/>

[Killed] ArithmeticOperator
main/pages/Admin/UsersIndexPage.jsx:64:19
             Previous
           </button>
           <span data-testid="UsersIndexPage-page-info">
-            Page {currentPage + 1} of {Math.max(totalPages, 1)}
+            Page {currentPage - 1} of {Math.max(totalPages, 1)}
           </span>
           <button
killedBy: UsersIndexPage tests paging works correctly
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Page 1 of 2
Received:
  Page -1 of 2

[Killed] ArrowFunction
main/pages/Admin/UsersIndexPage.jsx:68:22
           </span>
           <button
             className="btn btn-outline-secondary"
-            onClick={() =>
-              // Stryker disable next-line ArithmeticOperator: next button is disabled at last page, so + 1 is unreachable in practice
-              setCurrentPage((p) => Math.min(p + 1, totalPages - 1))
+            onClick={() => undefined
             }
             disabled={currentPage >= totalPages - 1}
killedBy: UsersIndexPage tests paging works correctly
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Page 2 of 2
Received:
  Page 1 of 2

[Killed] EqualityOperator
main/pages/Admin/UsersIndexPage.jsx:72:23
               // Stryker disable next-line ArithmeticOperator: next button is disabled at last page, so + 1 is unreachable in practice
               setCurrentPage((p) => Math.min(p + 1, totalPages - 1))
             }
-            disabled={currentPage >= totalPages - 1}
+            disabled={currentPage < totalPages - 1}
             data-testid="UsersIndexPage-next"
           >
killedBy: UsersIndexPage tests paging works correctly
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Page 2 of 2
Received:
  Page 1 of 2

[Killed] ConditionalExpression
main/pages/Admin/UsersIndexPage.jsx:72:23
               // Stryker disable next-line ArithmeticOperator: next button is disabled at last page, so + 1 is unreachable in practice
               setCurrentPage((p) => Math.min(p + 1, totalPages - 1))
             }
-            disabled={currentPage >= totalPages - 1}
+            disabled={true}
             data-testid="UsersIndexPage-next"
           >
killedBy: UsersIndexPage tests paging works correctly
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Page 2 of 2
Received:
  Page 1 of 2
