[Killed] LogicalOperator
main/components/Nav/AppNavbar.jsx:51:16
 
           <Navbar.Collapse className="justify-content-between">
             <Nav className="mr-auto">
-              {hasRole(currentUser, "ROLE_ADMIN") && (
-                <NavDropdown
-                  title="Admin"
-                  id="appnavbar-admin-dropdown"
-                  data-testid="appnavbar-admin-dropdown"
-                >
-                  <NavDropdown.Item as={Link} to="/admin/admins">
-                    Admins
-                  </NavDropdown.Item>
-                  <NavDropdown.Item as={Link} to="/admin/moderators">
-                    Moderators
-                  </NavDropdown.Item>
-                  <NavDropdown.Item as={Link} to="/admin/users">
-                    Users
-                  </NavDropdown.Item>
-                  <NavDropdown.Item as={Link} to="/admin/developer">
-                    Developer Info
-                  </NavDropdown.Item>
-                </NavDropdown>
-              )}
+              {hasRole(currentUser, "ROLE_ADMIN") || <NavDropdown title="Admin" id="appnavbar-admin-dropdown" data-testid="appnavbar-admin-dropdown">
+                  <NavDropdown.Item as={Link} to="/admin/admins">
+                    Admins
+                  </NavDropdown.Item>
+                  <NavDropdown.Item as={Link} to="/admin/moderators">
+                    Moderators
+                  </NavDropdown.Item>
+                  <NavDropdown.Item as={Link} to="/admin/users">
+                    Users
+                  </NavDropdown.Item>
+                  <NavDropdown.Item as={Link} to="/admin/developer">
+                    Developer Info
+                  </NavDropdown.Item>
+                </NavDropdown>}
 
               {(hasRole(currentUser, "ROLE_ADMIN") ||
killedBy: AppNavbar tests renders correctly for admin user
statusReason: Unable to find an element by: [data-testid="appnavbar-admin-dropdown"]

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-sm navbar-light bg-warning sticky-top"
      data-testid="AppNavbarLocalhost"

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.jsx:51:16
 
           <Navbar.Collapse className="justify-content-between">
             <Nav className="mr-auto">
-              {hasRole(currentUser, "ROLE_ADMIN") && (
-                <NavDropdown
-                  title="Admin"
-                  id="appnavbar-admin-dropdown"
-                  data-testid="appnavbar-admin-dropdown"
-                >
-                  <NavDropdown.Item as={Link} to="/admin/admins">
-                    Admins
-                  </NavDropdown.Item>
-                  <NavDropdown.Item as={Link} to="/admin/moderators">
-                    Moderators
-                  </NavDropdown.Item>
-                  <NavDropdown.Item as={Link} to="/admin/users">
-                    Users
-                  </NavDropdown.Item>
-                  <NavDropdown.Item as={Link} to="/admin/developer">
-                    Developer Info
-                  </NavDropdown.Item>
-                </NavDropdown>
-              )}
+              {true}
 
               {(hasRole(currentUser, "ROLE_ADMIN") ||
killedBy: AppNavbar tests renders correctly for admin user
statusReason: Unable to find an element by: [data-testid="appnavbar-admin-dropdown"]

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-sm navbar-light bg-warning sticky-top"
      data-testid="AppNavbarLocalhost"
