[Killed] StringLiteral
main/components/MenuItem/MenuItemTable.jsx:9:48
 export default function MenuItemTable({ menuItems, currentUser }) {
   const testid = "MenuItemTable";
   const navigate = useNavigate();
-  const [searchTerm, setSearchTerm] = useState("");
+  const [searchTerm, setSearchTerm] = useState("Stryker was here!");
   const reviewCallback = async (_cell) => {
     const itemId = _cell.row.original.id;
killedBy: MenuItemTable Tests Renders 5 Menu Items Correctly with ratings
statusReason: Unable to find an element by: [data-testid="MenuItemTable-cell-row-0-col-averageRating"]

Ignored nodes: comments, script, style
<body>
  <div>
    <input
      class="form-control mb-3"
      placeholder="Search by keywords (separated by space or comma)"

[Killed] ConditionalExpression
main/components/MenuItem/MenuItemTable.jsx:21:9
   };
 
   const calculateAverageRating = (reviews) => {
-    if (!reviews || !Array.isArray(reviews) || reviews.length === 0)
+    if (false)
       return "No reviews";
     const validRatings = reviews
killedBy: MenuItemTable Tests Renders 5 Menu Items Correctly with ratings
statusReason: Cannot read properties of null (reading 'filter')

[Killed] StringLiteral
main/components/MenuItem/MenuItemTable.jsx:49:28
     },
   ];
 
-  if (hasRole(currentUser, "ROLE_USER")) {
+  if (hasRole(currentUser, "")) {
     columns.push(
       ButtonColumn("Review Item", "warning", reviewCallback, testid),
killedBy: MenuItemTable Tests Navigation uses correct menu item id
statusReason: Unable to find an element by: [data-testid="MenuItemTable-cell-row-0-col-All Reviews-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <input
      class="form-control mb-3"
      placeholder="Search by keywords (separated by space or comma)"

[Killed] BlockStatement
main/components/MenuItem/MenuItemTable.jsx:60:52
   // Stryker disable all : equivalent mutation problem (but this is more optimal than its equivalent mutant without the +)
   const keywords = searchTerm.toLowerCase().split(/[\s,]+/);
   // Stryker restore all
-  const searchedItems = menuItems.filter((item) => {
-    return keywords.every(
-      (kw) =>
-        item.name.toLowerCase().includes(kw) ||
-        item.station.toLowerCase().includes(kw),
-    );
-  });
+  const searchedItems = menuItems.filter((item) => {});
 
   return (
killedBy: MenuItemPage MenuItemPage renders 5 Menu Items Correctly; MenuItemTable Tests Renders 5 Menu Items Correctly with ratings
statusReason: Unable to find an element by: [data-testid="MenuItemTable-cell-row-0-col-name"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrowFunction
main/components/MenuItem/MenuItemTable.jsx:62:7
   // Stryker restore all
   const searchedItems = menuItems.filter((item) => {
     return keywords.every(
-      (kw) =>
-        item.name.toLowerCase().includes(kw) ||
-        item.station.toLowerCase().includes(kw),
+      () => undefined,
     );
   });
killedBy: MenuItemTable Tests Renders 5 Menu Items Correctly with ratings; MenuItemPage MenuItemPage renders 5 Menu Items Correctly
statusReason: Unable to find an element by: [data-testid="MenuItemTable-cell-row-0-col-averageRating"]

Ignored nodes: comments, script, style
<body>
  <div>
    <input
      class="form-control mb-3"
      placeholder="Search by keywords (separated by space or comma)"

[Killed] ConditionalExpression
main/components/MenuItem/MenuItemTable.jsx:63:9
   const searchedItems = menuItems.filter((item) => {
     return keywords.every(
       (kw) =>
-        item.name.toLowerCase().includes(kw) ||
-        item.station.toLowerCase().includes(kw),
+        false,
     );
   });
killedBy: MenuItemTable Tests Renders 5 Menu Items Correctly with ratings
statusReason: Unable to find an element by: [data-testid="MenuItemTable-cell-row-0-col-averageRating"]

Ignored nodes: comments, script, style
<body>
  <div>
    <input
      class="form-control mb-3"
      placeholder="Search by keywords (separated by space or comma)"

[Killed] MethodExpression
main/components/MenuItem/MenuItemTable.jsx:64:9
     return keywords.every(
       (kw) =>
         item.name.toLowerCase().includes(kw) ||
-        item.station.toLowerCase().includes(kw),
+        item.station.toUpperCase().includes(kw),
     );
   });
killedBy: MenuItemTable Tests Search bar works correctly
statusReason: Unable to find an element with the text: Spicy Chicken. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <input
      class="form-control mb-3"
      placeholder="Search by keywords (separated by space or comma)"
