[Killed] BooleanLiteral
main/components/Reviews/ReviewsTable.jsx:21:46
 }) {
   const navigate = useNavigate();
   const queryClient = useQueryClient();
-  const [modalShow, setModalShow] = useState(false);
+  const [modalShow, setModalShow] = useState(true);
   const [pendingStatus, setPendingStatus] = useState(null);
   const [pendingCell, setPendingCell] = useState(null);
killedBy: ReviewsTable tests Moderator buttons appear and open modal on click
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-title h4"
  data-testid="ModeratorCommentsModal-title"
>
  Reject Review
</div> instead
