[Killed] StringLiteral
main/components/Users/UsersTable.jsx:14:11
 });
 
 const cellToAxiosParamsToggleModerator = (cell) => ({
-  method: "PUT",
+  method: "",
   url: "/api/admin/toggleModerator",
   params: { id: cell.row.values.id },
killedBy: UserTable tests Toggle Moderator button fires PUT to /api/admin/toggleModerator with user id
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <table

[Killed] BlockStatement
main/components/Users/UsersTable.jsx:96:41
   );
   // Stryker restore all
 
-  const toggleAdminCallback = (cell) => {
-    // Stryker disable next-line OptionalChaining
-    const selfUser = currentUser?.root?.user;
-    if (selfUser != null && selfUser.id === cell.row.values.id) {
-      setPendingCell(cell);
-      setShowModal(true);
-    } else {
-      toggleAdminMutation.mutate(cell);
-    }
-  };
+  const toggleAdminCallback = (cell) => {};
 
   // Stryker disable next-line all
killedBy: UserTable tests Toggle Admin on another user fires PUT directly without modal
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <table

[Killed] EqualityOperator
main/components/Users/UsersTable.jsx:99:9
   const toggleAdminCallback = (cell) => {
     // Stryker disable next-line OptionalChaining
     const selfUser = currentUser?.root?.user;
-    if (selfUser != null && selfUser.id === cell.row.values.id) {
+    if (selfUser == null && selfUser.id === cell.row.values.id) {
       setPendingCell(cell);
       setShowModal(true);
killedBy: UserTable tests Toggle Admin on own row shows confirmation modal
statusReason: Unable to find an element by: [data-testid="confirm-admin-toggle-modal"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] BlockStatement
main/components/Users/UsersTable.jsx:102:12
     if (selfUser != null && selfUser.id === cell.row.values.id) {
       setPendingCell(cell);
       setShowModal(true);
-    } else {
-      toggleAdminMutation.mutate(cell);
-    }
+    } else {}
   };
 
killedBy: UserTable tests Toggle Admin on another user fires PUT directly without modal
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <table

[Killed] BlockStatement
main/components/Users/UsersTable.jsx:118:30
     navigate("/");
   };
 
-  const handleCancel = () => {
-    setShowModal(false);
-    // Stryker disable next-line all
-    setPendingCell(null);
-  };
+  const handleCancel = () => {};
 
   const sortedUsers = useMemo(() => {
killedBy: UserTable tests Confirmation modal No button closes modal without toggling
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-dialog"
  data-testid="confirm-admin-toggle-modal"
>
  <div
    class="modal-content"

[Killed] BlockStatement
main/components/Users/UsersTable.jsx:124:37
     setPendingCell(null);
   };
 
-  const sortedUsers = useMemo(() => {
-    if (!Array.isArray(users)) return [];
-    const defaultEmails = Array.isArray(defaultAdminEmails)
-      ? defaultAdminEmails
-      : // Stryker disable next-line ArrayDeclaration
-        [];
-    return [...users].sort((a, b) => {
-      const aIsDefault = defaultEmails.includes(a.email);
-      const bIsDefault = defaultEmails.includes(b.email);
-      if (aIsDefault !== bIsDefault) return aIsDefault ? -1 : 1;
-      return a.id - b.id;
-    });
-  }, [users, defaultAdminEmails]);
+  const sortedUsers = useMemo(() => {}, [users, defaultAdminEmails]);
 
   const columns = [...baseColumns];
killedBy: UserTable tests renders without crashing for empty table
statusReason: Cannot read properties of undefined (reading 'forEach')

[Killed] ConditionalExpression
main/components/Users/UsersTable.jsx:125:9
   };
 
   const sortedUsers = useMemo(() => {
-    if (!Array.isArray(users)) return [];
+    if (false) return [];
     const defaultEmails = Array.isArray(defaultAdminEmails)
       ? defaultAdminEmails
killedBy: UserTable tests does not crash when users is not an array
statusReason: users is not iterable

[Killed] MethodExpression
main/components/Users/UsersTable.jsx:130:12
       ? defaultAdminEmails
       : // Stryker disable next-line ArrayDeclaration
         [];
-    return [...users].sort((a, b) => {
-      const aIsDefault = defaultEmails.includes(a.email);
-      const bIsDefault = defaultEmails.includes(b.email);
-      if (aIsDefault !== bIsDefault) return aIsDefault ? -1 : 1;
-      return a.id - b.id;
-    });
+    return [...users];
   }, [users, defaultAdminEmails]);
 
killedBy: UserTable tests Users are sorted with default admins first, then by id ascending
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  1
Received:
  5

[Killed] ConditionalExpression
main/components/Users/UsersTable.jsx:133:11
     return [...users].sort((a, b) => {
       const aIsDefault = defaultEmails.includes(a.email);
       const bIsDefault = defaultEmails.includes(b.email);
-      if (aIsDefault !== bIsDefault) return aIsDefault ? -1 : 1;
+      if (true) return aIsDefault ? -1 : 1;
       return a.id - b.id;
     });
killedBy: UserTable tests Users are sorted with default admins first, then by id ascending
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  3
Received:
  5

[Killed] ArithmeticOperator
main/components/Users/UsersTable.jsx:134:14
       const aIsDefault = defaultEmails.includes(a.email);
       const bIsDefault = defaultEmails.includes(b.email);
       if (aIsDefault !== bIsDefault) return aIsDefault ? -1 : 1;
-      return a.id - b.id;
+      return a.id + b.id;
     });
   }, [users, defaultAdminEmails]);
killedBy: UserTable tests Users are sorted with default admins first, then by id ascending
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  1
Received:
  2

[Killed] BlockStatement
main/components/Users/UsersTable.jsx:144:27
     columns.push({
       Header: "Toggle Admin",
       //id: "Toggle Admin",
-      Cell: ({ cell }) => {
-        const isDefaultAdmin =
-          Array.isArray(defaultAdminEmails) &&
-          defaultAdminEmails.includes(cell.row.values.email);
-        return (
-          <Button
-            variant="primary"
-            onClick={() => toggleAdminCallback(cell)}
-            disabled={isDefaultAdmin}
-            data-testid={`UsersTable-cell-row-${cell.row.index}-col-Toggle Admin-button`}
-          >
-            Toggle Admin
-          </Button>
-        );
-      },
+      Cell: ({ cell }) => {},
     });
     columns.push(
killedBy: UserTable tests Toggle role buttons appear when showToggleRoleButtons is true
statusReason: Unable to find an element by: [data-testid="UsersTable-cell-row-0-col-Toggle Admin-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ConditionalExpression
main/components/Users/UsersTable.jsx:146:11
       //id: "Toggle Admin",
       Cell: ({ cell }) => {
         const isDefaultAdmin =
-          Array.isArray(defaultAdminEmails) &&
-          defaultAdminEmails.includes(cell.row.values.email);
+          false;
         return (
           <Button
killedBy: UserTable tests Toggle Admin button is disabled for a default admin email
statusReason: expect(element).toBeDisabled()

Received element is not disabled:
  <button
  class="btn btn-primary"
  data-testid="UsersTable-cell-row-0-col-Toggle Admin-button"
  type="button"
/>
