[Killed] ConditionalExpression
main/pages/Reviews/EditReviewPage.jsx:52:7
     }
   };
 
-  if (isError) {
+  if (false) {
     return (
       <BasicLayout>
killedBy: EditReviewPage tests shows an error message when the review cannot be loaded
statusReason: Unable to find an element with the text: /Unable to load review/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
main/pages/Reviews/EditReviewPage.jsx:52:16
     }
   };
 
-  if (isError) {
-    return (
-      <BasicLayout>
-        <div className="pt-2">
-          <h1>Edit review with id {id}</h1>
-          <p>Unable to load review.</p>
-        </div>
-      </BasicLayout>
-    );
-  }
+  if (isError) {}
 
   if (isLoading || !review) {
killedBy: EditReviewPage tests shows an error message when the review cannot be loaded
statusReason: Unable to find an element with the text: /Unable to load review/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/pages/Reviews/EditReviewPage.jsx:63:7
     );
   }
 
-  if (isLoading || !review) {
+  if (false) {
     return (
       <BasicLayout>
killedBy: EditReviewPage tests renders the review in edit mode
statusReason: Cannot read properties of undefined (reading 'item')

[Killed] BooleanLiteral
main/pages/Reviews/EditReviewPage.jsx:63:20
     );
   }
 
-  if (isLoading || !review) {
+  if (isLoading || review) {
     return (
       <BasicLayout>
killedBy: EditReviewPage tests renders the review in edit mode
statusReason: Unable to find a label with the text of: /item name/i

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
