[Killed] OptionalChaining
main/pages/Reviews/PostReviewPage.jsx:27:20
     [],
   );
 
-  const itemName = menuItems?.name;
+  const itemName = menuItems.name;
 
   const submitReview = async (formData) => {
killedBy: PostReviewPage when menu item data is missing renders with an empty item name when the menu item has not loaded yet
statusReason: Cannot read properties of undefined (reading 'name')
