[Killed] ObjectLiteral
main/components/DiningCommons/DiningCommonsTable.jsx:19:5
       Header: "Name",
       accessor: "name",
     },
-    {
-      Header: "Meals Offered Today",
-      accessor: "mealsOfferedToday",
-      Cell: ({ value, row }) => {
-        return (
-          <div>
-            {!value || value.length === 0
-              ? "No meals offered today"
-              : value.map((meal) => (
-                  <span key={meal.id}>
-                    <Link
-                      to={`/diningcommons/${date}/${row.original.code}/${meal.code}`}
-                      className="p-2"
-                      data-testid={`DiningCommonsTable-cell-row-${row.index}-col-meal-${meal.code}`}
-                    >
-                      {meal.name}
-                    </Link>
-                  </span>
-                ))}
-          </div>
-        );
-      },
-    },
+    {},
     {
       Header: "Has Dining Cam",
killedBy: DiningCommonsTable tests Checkmark / X for Boolean columns shows up as expected, url shows up correctly
statusReason: A column ID (or string accessor) is required!

[Killed] ArrowFunction
main/components/DiningCommons/DiningCommonsTable.jsx:27:27
           <div>
             {!value || value.length === 0
               ? "No meals offered today"
-              : value.map((meal) => (
-                  <span key={meal.id}>
-                    <Link
-                      to={`/diningcommons/${date}/${row.original.code}/${meal.code}`}
-                      className="p-2"
-                      data-testid={`DiningCommonsTable-cell-row-${row.index}-col-meal-${meal.code}`}
-                    >
-                      {meal.name}
-                    </Link>
-                  </span>
-                ))}
+              : value.map(() => undefined)}
           </div>
         );
killedBy: HomePage meals offered today tests Renders correctly with mealsOfferedToday; DiningCommonsTable tests Meals Offered Today renders meal links correctly when there are meals offered
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Breakfast
Received:


Ignored nodes: comments, script, style

[Killed] StringLiteral
main/components/DiningCommons/DiningCommonsTable.jsx:32:36
                     <Link
                       to={`/diningcommons/${date}/${row.original.code}/${meal.code}`}
                       className="p-2"
-                      data-testid={`DiningCommonsTable-cell-row-${row.index}-col-meal-${meal.code}`}
+                      data-testid={``}
                     >
                       {meal.name}
killedBy: DiningCommonsTable tests meal links have correct testids
statusReason: Unable to find an element by: [data-testid="DiningCommonsTable-cell-row-0-col-meal-breakfast"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
