[Killed] MethodExpression
main/components/MyReviews/ReviewForm.jsx:14:29
   submitAction,
   buttonLabel = "Submit Review",
 }) {
-  const initialNow = useRef(new Date().toISOString().slice(0, 16));
+  const initialNow = useRef(new Date().toISOString());
   const formDefaults = useMemo(
     () => ({
killedBy: MyReviewsCreatePage - full coverage tests renders form fields with expected defaults
statusReason: expected '' not to be '' // Object.is equality

[Killed] ArrowFunction
main/components/MyReviews/ReviewForm.jsx:16:5
 }) {
   const initialNow = useRef(new Date().toISOString().slice(0, 16));
   const formDefaults = useMemo(
-    () => ({
-      reviewerComments: initialReviewerComments ?? "",
-      itemsStars: initialItemsStars ?? 5,
-      dateItemServed: initialDateItemServed ?? initialNow.current,
-    }),
+    () => undefined,
     [initialReviewerComments, initialItemsStars, initialDateItemServed],
   );
killedBy: EditReviewPage tests seeds the review form and submits update; MyReviewsCreatePage - full coverage tests renders form fields with expected defaults
statusReason: expect(element).toHaveValue(good food)

Expected the element to have value:
  good food
Received:

[Killed] StringLiteral
main/components/MyReviews/ReviewForm.jsx:17:52
   const initialNow = useRef(new Date().toISOString().slice(0, 16));
   const formDefaults = useMemo(
     () => ({
-      reviewerComments: initialReviewerComments ?? "",
+      reviewerComments: initialReviewerComments ?? "Stryker was here!",
       itemsStars: initialItemsStars ?? 5,
       dateItemServed: initialDateItemServed ?? initialNow.current,
killedBy: MyReviewsCreatePage - full coverage tests renders form fields with expected defaults
statusReason: expect(element).toHaveValue()

Expected the element to have value:

Received:
  Stryker was here!

[Killed] ArrayDeclaration
main/components/MyReviews/ReviewForm.jsx:21:5
       itemsStars: initialItemsStars ?? 5,
       dateItemServed: initialDateItemServed ?? initialNow.current,
     }),
-    [initialReviewerComments, initialItemsStars, initialDateItemServed],
+    [],
   );
 
killedBy: ReviewForm tests updates form values when props change
statusReason: expect(element).toHaveValue(second)

Expected the element to have value:
  second
Received:
  first

[Killed] LogicalOperator
main/components/MyReviews/ReviewForm.jsx:45:18
           data-testid="ReviewForm-review-item-name"
           id="review-item-name"
           type="text"
-          value={initialItemName ?? ""}
+          value={initialItemName && ""}
           disabled
         />
killedBy: EditReviewPage tests renders the review in edit mode
statusReason: expect(element).toHaveValue(Make Your Own Waffle (v))

Expected the element to have value:
  Make Your Own Waffle (v)
Received:
