[Killed] EqualityOperator
main/components/Reviews/ModeratorCommentsModal.jsx:31:12
     >
       <Modal.Header closeButton data-testid="ModeratorCommentsModal-header">
         <Modal.Title data-testid="ModeratorCommentsModal-title">
-          {status === "APPROVED" ? "Approve Review" : "Reject Review"}
+          {status !== "APPROVED" ? "Approve Review" : "Reject Review"}
         </Modal.Title>
       </Modal.Header>
killedBy: ModeratorCommentsModal tests renders Approve title when status is APPROVED
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Approve Review
Received:
  Reject Review

[Killed] EqualityOperator
main/components/Reviews/ModeratorCommentsModal.jsx:64:12
           onClick={handleSubmit}
           data-testid="ModeratorCommentsModal-submit"
         >
-          {status === "APPROVED" ? "Approve" : "Reject"}
+          {status !== "APPROVED" ? "Approve" : "Reject"}
         </Button>
       </Modal.Footer>
killedBy: ModeratorCommentsModal tests renders Approve title when status is APPROVED
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Approve
Received:
  Reject
