[Killed] BlockStatement
src/main/utils/currentUser.jsx:30:29
   );
 }
 
-export function useLogout() {
-  const queryClient = useQueryClient();
-  const navigate = useNavigate();
-  const mutation = useMutation(async () => {
-    await axios.post("/logout");
-    navigate("/");
-    await queryClient.resetQueries("current user", { exact: true });
-  });
-  return mutation;
-}
+export function useLogout() {}
 
 export function hasRole(currentUser, role) {
killedBy: utils/currentUser tests useLogout tests useLogout navigates to root before resetting queries
statusReason: expected "vi.fn()" to be called at least once
