[Killed] BlockStatement
main/components/MenuItem/MenuItemTable.jsx:10:43
   const testid = "MenuItemTable";
   const navigate = useNavigate();
   const [searchTerm, setSearchTerm] = useState("");
-  const reviewCallback = async (_cell) => {
-    const itemId = _cell.row.original.id;
-    navigate(`/reviews/post/${itemId}`);
-  };
+  const reviewCallback = async (_cell) => {};
 
   const viewCallback = async (_cell) => {
killedBy: MenuItemTable Tests Buttons work correctly
statusReason: expected "vi.fn()" to be called with arguments: [ '/reviews/post/1' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ConditionalExpression
main/components/MenuItem/MenuItemTable.jsx:21:9
   };
 
   const calculateAverageRating = (reviews) => {
-    if (!reviews || !Array.isArray(reviews) || reviews.length === 0)
+    if (false || reviews.length === 0)
       return "No reviews";
     const validRatings = reviews
killedBy: MenuItemPage MenuItemPage renders 5 Menu Items Correctly; MenuItemTable Tests Renders 5 Menu Items Correctly with ratings
statusReason: Unable to find an element by: [data-testid="MenuItemTable-cell-row-0-col-name"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] MethodExpression
main/components/MenuItem/MenuItemTable.jsx:61:12
   const keywords = searchTerm.toLowerCase().split(/[\s,]+/);
   // Stryker restore all
   const searchedItems = menuItems.filter((item) => {
-    return keywords.every(
-      (kw) =>
-        item.name.toLowerCase().includes(kw) ||
-        item.station.toLowerCase().includes(kw),
-    );
+    return keywords.some(kw => item.name.toLowerCase().includes(kw) || item.station.toLowerCase().includes(kw));
   });
 
killedBy: MenuItemTable Tests Search bar works correctly
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <td
  data-testid="MenuItemTable-cell-row-0-col-name"
  role="cell"
>
  Spicy Chicken
</td> instead
