[Killed] ConditionalExpression
main/components/Users/UsersTable.jsx:99:9
   const toggleAdminCallback = (cell) => {
     // Stryker disable next-line OptionalChaining
     const selfUser = currentUser?.root?.user;
-    if (selfUser != null && selfUser.id === cell.row.values.id) {
+    if (true) {
       setPendingCell(cell);
       setShowModal(true);
killedBy: UserTable tests Toggle Admin on another user fires PUT directly without modal
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] ConditionalExpression
main/components/Users/UsersTable.jsx:125:9
   };
 
   const sortedUsers = useMemo(() => {
-    if (!Array.isArray(users)) return [];
+    if (true) return [];
     const defaultEmails = Array.isArray(defaultAdminEmails)
       ? defaultAdminEmails
killedBy: UserTable tests Has the expected column headers and content
statusReason: Unable to find an element by: [data-testid="UsersTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] EqualityOperator
main/components/Users/UsersTable.jsx:133:11
     return [...users].sort((a, b) => {
       const aIsDefault = defaultEmails.includes(a.email);
       const bIsDefault = defaultEmails.includes(b.email);
-      if (aIsDefault !== bIsDefault) return aIsDefault ? -1 : 1;
+      if (aIsDefault === bIsDefault) return aIsDefault ? -1 : 1;
       return a.id - b.id;
     });
killedBy: UserTable tests Users are sorted with default admins first, then by id ascending
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  3
Received:
  5

[Killed] ConditionalExpression
main/components/Users/UsersTable.jsx:140:7
 
   const columns = [...baseColumns];
 
-  if (showToggleRoleButtons) {
+  if (true) {
     columns.push({
       Header: "Toggle Admin",
killedBy: UserTable tests Toggle role buttons do not appear when showToggleRoleButtons is false
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button
  class="btn btn-primary"
  data-testid="UsersTable-cell-row-0-col-Toggle Admin-button"
  type="button"
>
  Toggle Admin

[Killed] ConditionalExpression
main/components/Users/UsersTable.jsx:146:11
       //id: "Toggle Admin",
       Cell: ({ cell }) => {
         const isDefaultAdmin =
-          Array.isArray(defaultAdminEmails) &&
-          defaultAdminEmails.includes(cell.row.values.email);
+          true;
         return (
           <Button
killedBy: UserTable tests Toggle Admin on another user fires PUT directly without modal
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <table

[Killed] ArrowFunction
main/components/Users/UsersTable.jsx:151:22
         return (
           <Button
             variant="primary"
-            onClick={() => toggleAdminCallback(cell)}
+            onClick={() => undefined}
             disabled={isDefaultAdmin}
             data-testid={`UsersTable-cell-row-${cell.row.index}-col-Toggle Admin-button`}
killedBy: UserTable tests Toggle Admin on another user fires PUT directly without modal
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <table

[Killed] StringLiteral
main/components/Users/UsersTable.jsx:172:62
 
   return (
     <>
-      <OurTable data={sortedUsers} columns={columns} testid={"UsersTable"} />
+      <OurTable data={sortedUsers} columns={columns} testid={""} />
       {showModal && (
         <Modal
killedBy: AdminUsersPage tests renders users table with data; UserTable tests Has the expected column headers and content
statusReason: Unable to find an element by: [data-testid="UsersTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
