[Killed] BlockStatement
main/pages/Reviews/EditReviewPage.jsx:31:9
   );
 
   const submitReview = async (formData) => {
-    try {
-      await axios.put(
-        "/api/reviews/reviewer",
-        {
-          itemStars: formData.itemsStars,
-          reviewerComments: formData.reviewerComments,
-          dateItemServed: formData.dateItemServed,
-        },
-        {
-          params: { id },
-        },
-      );
-      toast(`Review updated for ${review.item.name}`);
-      navigate(-1);
-    } catch (err) {
+    try {} catch (err) {
       toast.error(
         `Error updating review: ${err.response?.data?.error || err.message}`,
killedBy: EditReviewPage tests seeds the review form and submits update
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] UnaryOperator
main/pages/Reviews/EditReviewPage.jsx:44:16
         },
       );
       toast(`Review updated for ${review.item.name}`);
-      navigate(-1);
+      navigate(+1);
     } catch (err) {
       toast.error(
killedBy: EditReviewPage tests seeds the review form and submits update
statusReason: expected "vi.fn()" to be called with arguments: [ -1 ]

Received: 

  1st vi.fn() call:

  [
-   -1,

[Killed] ConditionalExpression
main/pages/Reviews/EditReviewPage.jsx:63:7
     );
   }
 
-  if (isLoading || !review) {
+  if (true) {
     return (
       <BasicLayout>
killedBy: EditReviewPage tests renders the review in edit mode
statusReason: Unable to find a label with the text of: /item name/i

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
