[Killed] BlockStatement
src/main/utils/useBackend.jsx:78:3
   objectToAxiosParams,
   useMutationParams,
   queryKey = null,
-) {
-  const queryClient = useQueryClient();
-
-  return useMutation((object) => wrappedParams(objectToAxiosParams(object)), {
-    onError: (data) => {
-      toast(`${data}`);
-    },
-    // Stryker disable all: Not sure how to set up the complex behavior needed to test this
-    onSettled: () => {
-      if (queryKey !== null) {
-        // Handle array of query keys for cache invalidation
-        // this is unlike native React behavior, but was implemented for parity with proj-frontiers
-        if (Array.isArray(queryKey)) {
-          queryKey.forEach((key) => {
-            queryClient.invalidateQueries({ queryKey: [key] });
-          });
-        }
-      }
-    },
-    // Stryker restore all
-    retry: false,
-    ...useMutationParams,
-  });
-}
+) {}
 
killedBy: utils/useBackend tests utils/useBackend useBackendMutation tests useBackendMutation handles success correctly
statusReason: Cannot read properties of undefined (reading 'mutate')
