[Killed] LogicalOperator
main/components/MyReviews/ReviewForm.jsx:17:25
   const initialNow = useRef(new Date().toISOString().slice(0, 16));
   const formDefaults = useMemo(
     () => ({
-      reviewerComments: initialReviewerComments ?? "",
+      reviewerComments: initialReviewerComments && "",
       itemsStars: initialItemsStars ?? 5,
       dateItemServed: initialDateItemServed ?? initialNow.current,
killedBy: EditReviewPage tests seeds the review form and submits update
statusReason: expect(element).toHaveValue(good food)

Expected the element to have value:
  good food
Received:

[Killed] LogicalOperator
main/components/MyReviews/ReviewForm.jsx:18:19
   const formDefaults = useMemo(
     () => ({
       reviewerComments: initialReviewerComments ?? "",
-      itemsStars: initialItemsStars ?? 5,
+      itemsStars: initialItemsStars && 5,
       dateItemServed: initialDateItemServed ?? initialNow.current,
     }),
killedBy: EditReviewPage tests seeds the review form and submits update
statusReason: expect(element).toHaveValue(4)

Expected the element to have value:
  4
Received:
  5

[Survived] ObjectLiteral
main/components/MyReviews/ReviewForm.jsx:29:15
     formState: { errors },
     handleSubmit,
     reset,
-  } = useForm({
-    defaultValues: formDefaults,
-  });
+  } = useForm({});
 
   useEffect(() => {
