[Killed] ArrowFunction
src/main/pages/ModeratePage.js:13:38
 export default function ModeratePage() {
   const { data: currentUser } = useCurrentUser();
 
-  const objectToAxiosParamsApprove = (alias) => ({
-    url: "/api/currentUser/updateAliasModeration",
-    method: "PUT",
-    params: { id: alias.id, approved: true },
-  });
+  const objectToAxiosParamsApprove = () => undefined;
   const approveMutation = useBackendMutation(
     objectToAxiosParamsApprove,
killedBy: ModeratePage approveMutation.mutate receives correct axios params object
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"method": "PUT", "params": {"approved": true, "id": 1}, "url": "/api/currentUser/updateAliasModeration"}
Received: undefined

[Killed] StringLiteral
src/main/pages/ModeratePage.js:14:10
   const { data: currentUser } = useCurrentUser();
 
   const objectToAxiosParamsApprove = (alias) => ({
-    url: "/api/currentUser/updateAliasModeration",
+    url: "",
     method: "PUT",
     params: { id: alias.id, approved: true },
killedBy: ModeratePage approveMutation.mutate receives correct axios params object
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -2,7 +2,7 @@
    "method": "PUT",
    "params": Object {

[Killed] BooleanLiteral
src/main/pages/ModeratePage.js:16:39
   const objectToAxiosParamsApprove = (alias) => ({
     url: "/api/currentUser/updateAliasModeration",
     method: "PUT",
-    params: { id: alias.id, approved: true },
+    params: { id: alias.id, approved: false },
   });
   const approveMutation = useBackendMutation(
killedBy: ModeratePage approveMutation.mutate receives correct axios params object
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "method": "PUT",
    "params": Object {

[Killed] ObjectLiteral
src/main/pages/ModeratePage.js:16:13
   const objectToAxiosParamsApprove = (alias) => ({
     url: "/api/currentUser/updateAliasModeration",
     method: "PUT",
-    params: { id: alias.id, approved: true },
+    params: {},
   });
   const approveMutation = useBackendMutation(
killedBy: ModeratePage approveMutation.mutate receives correct axios params object
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 1

  Object {
    "method": "PUT",
-   "params": Object {

[Killed] BlockStatement
src/main/pages/ModeratePage.js:22:35
     objectToAxiosParamsApprove,
     ["/api/admin/usersWithProposedAlias"],
     {
-      onSuccess: (data, alias) => {
-        toast.success(
-          `Alias "${alias.proposedAlias}" for ID ${alias.id} approved!`,
-        );
-      },
+      onSuccess: (data, alias) => {},
       onError: (error) => {
         toast.error(
killedBy: ModeratePage displays toast.success on approve success
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Alias \"Ali1\" for ID 1 approved!"

Number of calls: 0

[Killed] BlockStatement
src/main/pages/ModeratePage.js:27:27
           `Alias "${alias.proposedAlias}" for ID ${alias.id} approved!`,
         );
       },
-      onError: (error) => {
-        toast.error(
-          `Error approving alias: ${error.message || "Unknown error"}`,
-        );
-      },
+      onError: (error) => {},
     },
   );
killedBy: ModeratePage displays toast.error on approve error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Error approving alias: Some approve error"

Number of calls: 0

[Killed] ConditionalExpression
src/main/pages/ModeratePage.js:29:37
       },
       onError: (error) => {
         toast.error(
-          `Error approving alias: ${error.message || "Unknown error"}`,
+          `Error approving alias: ${true}`,
         );
       },
killedBy: ModeratePage displays toast.error on approve error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Error approving alias: Some approve error"
Received: "Error approving alias: true"

Number of calls: 1

[Killed] ConditionalExpression
src/main/pages/ModeratePage.js:29:37
       },
       onError: (error) => {
         toast.error(
-          `Error approving alias: ${error.message || "Unknown error"}`,
+          `Error approving alias: ${false}`,
         );
       },
killedBy: ModeratePage displays toast.error on approve error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Error approving alias: Some approve error"
Received: "Error approving alias: false"

Number of calls: 1

[Killed] ArrowFunction
src/main/pages/ModeratePage.js:35:37
     },
   );
 
-  const objectToAxiosParamsReject = (alias) => ({
-    url: "/api/currentUser/updateAliasModeration",
-    method: "PUT",
-    params: { id: alias.id, approved: false },
-  });
+  const objectToAxiosParamsReject = () => undefined;
   const rejectMutation = useBackendMutation(
     objectToAxiosParamsReject,
killedBy: ModeratePage rejectMutation.mutate receives correct axios params object
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"method": "PUT", "params": {"approved": false, "id": 1}, "url": "/api/currentUser/updateAliasModeration"}
Received: undefined

[Killed] ObjectLiteral
src/main/pages/ModeratePage.js:35:49
     },
   );
 
-  const objectToAxiosParamsReject = (alias) => ({
-    url: "/api/currentUser/updateAliasModeration",
-    method: "PUT",
-    params: { id: alias.id, approved: false },
-  });
+  const objectToAxiosParamsReject = (alias) => ({});
   const rejectMutation = useBackendMutation(
     objectToAxiosParamsReject,
killedBy: ModeratePage rejectMutation.mutate receives correct axios params object
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 8
+ Received  + 1

- Object {
-   "method": "PUT",
-   "params": Object {

[Killed] StringLiteral
src/main/pages/ModeratePage.js:36:10
   );
 
   const objectToAxiosParamsReject = (alias) => ({
-    url: "/api/currentUser/updateAliasModeration",
+    url: "",
     method: "PUT",
     params: { id: alias.id, approved: false },
killedBy: ModeratePage rejectMutation.mutate receives correct axios params object
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -2,7 +2,7 @@
    "method": "PUT",
    "params": Object {

[Killed] BooleanLiteral
src/main/pages/ModeratePage.js:38:39
   const objectToAxiosParamsReject = (alias) => ({
     url: "/api/currentUser/updateAliasModeration",
     method: "PUT",
-    params: { id: alias.id, approved: false },
+    params: { id: alias.id, approved: true },
   });
   const rejectMutation = useBackendMutation(
killedBy: ModeratePage rejectMutation.mutate receives correct axios params object
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "method": "PUT",
    "params": Object {

[Killed] ArrayDeclaration
src/main/pages/ModeratePage.js:42:5
   });
   const rejectMutation = useBackendMutation(
     objectToAxiosParamsReject,
-    ["/api/admin/usersWithProposedAlias"],
+    [],
     {
       onSuccess: (data, alias) => {
killedBy: ModeratePage useBackendMutation is called with correct query key (should not be [] or [''])
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   "/api/admin/usersWithProposedAlias",
- ]

[Killed] ObjectLiteral
src/main/pages/ModeratePage.js:43:5
   const rejectMutation = useBackendMutation(
     objectToAxiosParamsReject,
     ["/api/admin/usersWithProposedAlias"],
-    {
-      onSuccess: (data, alias) => {
-        toast.success(
-          `Alias "${alias.proposedAlias}" for ID ${alias.id} rejected!`,
-        );
-      },
-      onError: (error) => {
-        toast.error(
-          `Error rejecting alias: ${error.message || "Unknown error"}`,
-        );
-      },
-    },
+    {},
   );
 
killedBy: ModeratePage displays toast.success on reject success
statusReason: TypeError: options.onSuccess is not a function

[Killed] BlockStatement
src/main/pages/ModeratePage.js:44:35
     objectToAxiosParamsReject,
     ["/api/admin/usersWithProposedAlias"],
     {
-      onSuccess: (data, alias) => {
-        toast.success(
-          `Alias "${alias.proposedAlias}" for ID ${alias.id} rejected!`,
-        );
-      },
+      onSuccess: (data, alias) => {},
       onError: (error) => {
         toast.error(
killedBy: ModeratePage displays toast.success on reject success
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Alias \"Ali1\" for ID 1 rejected!"

Number of calls: 0

[Killed] StringLiteral
src/main/pages/ModeratePage.js:46:11
     {
       onSuccess: (data, alias) => {
         toast.success(
-          `Alias "${alias.proposedAlias}" for ID ${alias.id} rejected!`,
+          ``,
         );
       },
killedBy: ModeratePage displays toast.success on reject success
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Alias \"Ali1\" for ID 1 rejected!"
Received: ""

Number of calls: 1

[Killed] BlockStatement
src/main/pages/ModeratePage.js:49:27
           `Alias "${alias.proposedAlias}" for ID ${alias.id} rejected!`,
         );
       },
-      onError: (error) => {
-        toast.error(
-          `Error rejecting alias: ${error.message || "Unknown error"}`,
-        );
-      },
+      onError: (error) => {},
     },
   );
killedBy: ModeratePage displays toast.error on reject error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Error rejecting alias: Some reject error"

Number of calls: 0

[Killed] ConditionalExpression
src/main/pages/ModeratePage.js:51:37
       },
       onError: (error) => {
         toast.error(
-          `Error rejecting alias: ${error.message || "Unknown error"}`,
+          `Error rejecting alias: ${true}`,
         );
       },
killedBy: ModeratePage displays toast.error on reject error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Error rejecting alias: Some reject error"
Received: "Error rejecting alias: true"

Number of calls: 1

[Killed] ConditionalExpression
src/main/pages/ModeratePage.js:51:37
       },
       onError: (error) => {
         toast.error(
-          `Error rejecting alias: ${error.message || "Unknown error"}`,
+          `Error rejecting alias: ${false}`,
         );
       },
killedBy: ModeratePage displays toast.error on reject error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Error rejecting alias: Some reject error"
Received: "Error rejecting alias: false"

Number of calls: 1

[Killed] StringLiteral
src/main/pages/ModeratePage.js:58:13
   );
 
   const { data: aliases } = useBackend(["/api/admin/usersWithProposedAlias"], {
-    method: "GET",
+    method: "",
     url: "/api/admin/usersWithProposedAlias",
   });
killedBy: ModeratePage useBackend is called with correct queryKey and axiosParameters
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  ["/api/admin/usersWithProposedAlias"],
  Object {
-   "method": "GET",

[Killed] ConditionalExpression
src/main/pages/ModeratePage.js:63:5
   });
 
   if (
-    !currentUser.loggedIn ||
-    (!hasRole(currentUser, "ROLE_ADMIN") &&
-      !hasRole(currentUser, "ROLE_MODERATOR"))
+    true
   ) {
     return <Navigate to="/" />;
killedBy: ModeratePage renders alias awaiting approval
statusReason: Error: Unable to find an element with the text: Ali1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] BooleanLiteral
src/main/pages/ModeratePage.js:63:5
   });
 
   if (
-    !currentUser.loggedIn ||
+    currentUser.loggedIn ||
     (!hasRole(currentUser, "ROLE_ADMIN") &&
       !hasRole(currentUser, "ROLE_MODERATOR"))
killedBy: ModeratePage renders alias awaiting approval
statusReason: Error: Unable to find an element with the text: Ali1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] BlockStatement
src/main/pages/ModeratePage.js:70:36
     return <Navigate to="/" />;
   }
 
-  const handleApprove = (alias) => {
-    approveMutation.mutate(alias);
-  };
+  const handleApprove = (alias) => {};
   const handleReject = (alias) => {
     rejectMutation.mutate(alias);
killedBy: ModeratePage approveMutation.mutate receives correct axios params object
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)


Number of calls: 0

[Killed] BlockStatement
src/main/pages/ModeratePage.js:73:35
   const handleApprove = (alias) => {
     approveMutation.mutate(alias);
   };
-  const handleReject = (alias) => {
-    rejectMutation.mutate(alias);
-  };
+  const handleReject = (alias) => {};
 
   return (
killedBy: ModeratePage rejectMutation.mutate receives correct axios params object
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)


Number of calls: 0

[Killed] LogicalOperator
src/main/pages/ModeratePage.js:83:20
         <h1>Moderation Page</h1>
         <p>This page is accessible only to admins and moderators.</p>
         <AliasTable
-          aliases={aliases || []}
+          aliases={aliases && []}
           onApprove={handleApprove}
           onReject={handleReject}
killedBy: ModeratePage renders alias awaiting approval
statusReason: Error: Unable to find an element with the text: Ali1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="basic-layout"
    >

[Killed] ConditionalExpression
src/main/pages/ModeratePage.js:83:20
         <h1>Moderation Page</h1>
         <p>This page is accessible only to admins and moderators.</p>
         <AliasTable
-          aliases={aliases || []}
+          aliases={false}
           onApprove={handleApprove}
           onReject={handleReject}
killedBy: ModeratePage renders alias awaiting approval
statusReason: Error: Unable to find an element with the text: Ali1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="basic-layout"
    >
