[Killed] BlockStatement
main/components/MenuItem/MenuItemTable.jsx:47:42
     },
   ];
 
-  if (hasRole(currentUser, "ROLE_USER")) {
-    columns.push(
-      ButtonColumn("Review Item", "warning", reviewCallback, testid),
-    );
-    columns.push(ButtonColumn("All Reviews", "warning", viewCallback, testid));
-  }
+  if (hasRole(currentUser, "ROLE_USER")) {}
 
   return <OurTable columns={columns} data={menuItems} testid={testid} />;
killedBy: MenuItemTable Tests Navigation uses correct menu item id
statusReason: Unable to find an element by: [data-testid="MenuItemTable-cell-row-0-col-All Reviews-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
