[Killed] BlockStatement
src/main/utils/currentUser.jsx:50:44
 
     if (currentUser == null) return false;
 
-    if (currentUser.data?.root?.rolesList) {
-        return currentUser.data.root.rolesList.includes(role);
-    }
+    if (currentUser.data?.root?.rolesList) {}
 
     return currentUser.root?.rolesList?.includes(role);
killedBy: utils/currentUser tests hasRole tests hasRole returns correct values when data is in currentUser
statusReason: expected undefined to be truthy
