[Killed] StringLiteral
main/components/Reviews/ReviewsTable.jsx:60:15
 
   const columns = [
     {
-      Header: "Item Id",
+      Header: "",
       accessor: "item.id",
     },
killedBy: ReviewsTable tests Has the base column headers and content
statusReason: Unable to find an element with the text: Item Id. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ObjectLiteral
main/components/Reviews/ReviewsTable.jsx:72:5
       accessor: "itemsStars",
       Cell: ({ value }) => "⭐".repeat(value),
     },
-    {
-      Header: "Comments",
-      accessor: "reviewerComments",
-    },
+    {},
     {
       Header: "Date Served",
killedBy: Moderate Page Tests renders reviews with approve/reject buttons for moderator; MyReviewsIndexPage tests renders three reviews correctly for regular user
statusReason: A column ID (or string accessor) is required!
