[Killed] ObjectLiteral
src/main/pages/ModeratePage.jsx:17:5
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     ["/api/reviews/needsmoderation"],
-    { method: "GET", url: "/api/reviews/needsmoderation" },
+    {},
     // Stryker disable next-line all : don't test internal caching of React Query
     [],
killedBy: Moderate Page Tests renders reviews with approve/reject buttons for moderator
statusReason: Unable to find an element by: [data-testid="Reviewstable-cell-row-0-col-item.id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
