[Killed] ObjectLiteral
main/pages/MyReviews/MyReviewsIndexPage.jsx:18:5
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     ["/api/reviews/userReviews"],
-    { method: "GET", url: "/api/reviews/userReviews" },
+    {},
     [],
   );
killedBy: MyReviewsIndexPage tests renders three reviews correctly for regular user
statusReason: Unable to find an element by: [data-testid="Reviewstable-cell-row-0-col-item.id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
