[Killed] BlockStatement
main/pages/Reviews/ReviewsPage.jsx:6:39
 import { useParams } from "react-router";
 import ReviewsTable from "main/components/Reviews/ReviewsTable";
 
-export default function ReviewsPage() {
-  const { itemid } = useParams();
-  const {
-    data: reviews,
-    error: _error,
-    status: _status,
-  } = useBackend(
-    // Stryker disable next-line all : don't test internal caching of React Query
-    [`/api/reviews/approved/forItem/${itemid}`],
-    { method: "GET", url: `/api/reviews/approved/forItem/${itemid}` },
-    [],
-  );
-
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Reviews for Menu Item {itemid}</h1>
-        <ReviewsTable reviews={reviews} />
-      </div>
-    </BasicLayout>
-  );
-}
+export default function ReviewsPage() {}
 
killedBy: ReviewsPage tests renders empty table when backend is unavailable
statusReason: expected 0 to be greater than or equal to 1

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>
