[Killed] ObjectLiteral
src/main/utils/useBackend.jsx:75:78
 ) {
   const queryClient = useQueryClient();
 
-  return useMutation((object) => wrappedParams(objectToAxiosParams(object)), {
-    onError: (data) => {
-      toast(`${data}`);
-    },
-    // Stryker disable all: Not sure how to set up the complex behavior needed to test this
-    onSettled: () => {
-      if (queryKey !== null) queryClient.invalidateQueries(queryKey);
-    },
-    // Stryker restore all
-    retry: false,
-    ...useMutationParams,
-  });
+  return useMutation((object) => wrappedParams(objectToAxiosParams(object)), {});
 }
 
killedBy: utils/useBackend tests utils/useBackend useBackendMutation tests useBackendMutation handles success correctly
statusReason: expected "vi.fn()" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>
