[Killed] BlockStatement
main/components/AliasApproval/AliasApprovalTable.jsx:8:4
   aliases,
   approveCallback,
   rejectCallback,
-}) {
-  const testid = "Aliasapprovaltable";
-
-  const columns = [
-    {
-      Header: "Proposed Alias",
-      accessor: "proposedAlias",
-    },
-  ];
-
-  columns.push(ButtonColumn("Approve", "primary", approveCallback, testid));
-  columns.push(ButtonColumn("Reject", "danger", rejectCallback, testid));
-
-  return (
-    <OurTable
-      data={aliases.filter((user) => user.status === "AWAITING_REVIEW")}
-      columns={columns}
-      testid={testid}
-    />
-  );
-}
+}) {}
 
killedBy: AliasApprovalTable tests renders the header even with no data
statusReason: Unable to find an element with the text: Proposed Alias. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] StringLiteral
main/components/AliasApproval/AliasApprovalTable.jsx:9:18
   approveCallback,
   rejectCallback,
 }) {
-  const testid = "Aliasapprovaltable";
+  const testid = "";
 
   const columns = [
killedBy: AliasApprovalTable tests renders the header even with no data
statusReason: Unable to find an element by: [data-testid="Aliasapprovaltable-header-proposedAlias"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ArrayDeclaration
main/components/AliasApproval/AliasApprovalTable.jsx:11:19
 }) {
   const testid = "Aliasapprovaltable";
 
-  const columns = [
-    {
-      Header: "Proposed Alias",
-      accessor: "proposedAlias",
-    },
-  ];
+  const columns = [];
 
   columns.push(ButtonColumn("Approve", "primary", approveCallback, testid));
killedBy: AliasApprovalTable tests renders the header even with no data
statusReason: Unable to find an element with the text: Proposed Alias. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ObjectLiteral
main/components/AliasApproval/AliasApprovalTable.jsx:12:5
   const testid = "Aliasapprovaltable";
 
   const columns = [
-    {
-      Header: "Proposed Alias",
-      accessor: "proposedAlias",
-    },
+    {},
   ];
 
killedBy: AliasApprovalTable tests renders the header even with no data
statusReason: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/AliasApproval/AliasApprovalTable.jsx:18:29
     },
   ];
 
-  columns.push(ButtonColumn("Approve", "primary", approveCallback, testid));
+  columns.push(ButtonColumn("", "primary", approveCallback, testid));
   columns.push(ButtonColumn("Reject", "danger", rejectCallback, testid));
 
killedBy: AliasApprovalTable tests renders the header even with no data
statusReason: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/AliasApproval/AliasApprovalTable.jsx:19:29
   ];
 
   columns.push(ButtonColumn("Approve", "primary", approveCallback, testid));
-  columns.push(ButtonColumn("Reject", "danger", rejectCallback, testid));
+  columns.push(ButtonColumn("", "danger", rejectCallback, testid));
 
   return (
killedBy: AliasApprovalTable tests renders the header even with no data
statusReason: A column ID (or string accessor) is required!
