[Killed] ObjectLiteral
main/components/DiningCommons/DiningCommonsTable.jsx:19:5
       Header: "Name",
       accessor: "name",
     },
-    {
-      Header: "Has Dining Cam",
-      accessor: "hasDiningCam",
-      // Credits to Jayden for the code here!
-      // Renders a checkmark box.
-      Cell: ({ value }) => (value ? "✅" : "❌"),
-    },
+    {},
     {
       Header: "Has Sack Meal",
killedBy: DiningCommonsTable tests Checkmark / X for Boolean columns shows up as expected, url shows up correctly
statusReason: A column ID (or string accessor) is required!
