[Killed] StringLiteral
main/components/MenuItem/MenuItemTable.jsx:10:14
   const navigate = useNavigate();
   const reviewCallback = async (_cell) => {
     const itemId = _cell.row.original.id;
-    navigate(`/reviews/post/${itemId}`);
+    navigate(``);
   };
 
killedBy: MenuItemTable Tests Buttons work correctly
statusReason: expected "vi.fn()" to be called with arguments: [ '/reviews/post/1' ]

Received: 

  1st vi.fn() call:

  [
-   "/reviews/post/1",

[Killed] BlockStatement
main/components/MenuItem/MenuItemTable.jsx:13:41
     navigate(`/reviews/post/${itemId}`);
   };
 
-  const viewCallback = async (_cell) => {
-    const itemId = _cell.row.original.id;
-    navigate(`/reviews/${itemId}`);
-  };
+  const viewCallback = async (_cell) => {};
 
   const calculateAverageRating = (reviews) => {
killedBy: MenuItemTable Tests Navigation uses correct menu item id
statusReason: expected "vi.fn()" to be called with arguments: [ '/reviews/42' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ConditionalExpression
main/components/MenuItem/MenuItemTable.jsx:23:21
       return "No reviews";
     const validRatings = reviews
       .filter(
-        (r) => r && typeof r === "object" && typeof r.itemsStars === "number",
+        (r) => r && true && typeof r.itemsStars === "number",
       )
       .map((r) => r.itemsStars);
killedBy: MenuItemTable Tests calculateAverageRating properly validates object types
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  4.5
Received:
  4.2

[Killed] ConditionalExpression
main/components/MenuItem/MenuItemTable.jsx:23:16
       return "No reviews";
     const validRatings = reviews
       .filter(
-        (r) => r && typeof r === "object" && typeof r.itemsStars === "number",
+        (r) => false,
       )
       .map((r) => r.itemsStars);
killedBy: MenuItemTable Tests Renders 5 Menu Items Correctly with ratings
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  4.5
Received:
  No ratings

[Killed] ConditionalExpression
main/components/MenuItem/MenuItemTable.jsx:26:9
         (r) => r && typeof r === "object" && typeof r.itemsStars === "number",
       )
       .map((r) => r.itemsStars);
-    if (validRatings.length === 0) return "No ratings";
+    if (true) return "No ratings";
     const avg = validRatings.reduce((a, b) => a + b, 0) / validRatings.length;
     return avg.toFixed(1);
killedBy: MenuItemTable Tests Renders 5 Menu Items Correctly with ratings
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  4.5
Received:
  No ratings

[Killed] ArrowFunction
main/components/MenuItem/MenuItemTable.jsx:27:37
       )
       .map((r) => r.itemsStars);
     if (validRatings.length === 0) return "No ratings";
-    const avg = validRatings.reduce((a, b) => a + b, 0) / validRatings.length;
+    const avg = validRatings.reduce(() => undefined, 0) / validRatings.length;
     return avg.toFixed(1);
   };
killedBy: MenuItemTable Tests Renders 5 Menu Items Correctly with ratings
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  4.5
Received:
  NaN

[Killed] StringLiteral
main/components/MenuItem/MenuItemTable.jsx:41:15
       accessor: "station",
     },
     {
-      Header: "Average Rating",
+      Header: "",
       accessor: (row) => calculateAverageRating(row.reviews),
       id: "averageRating",
killedBy: MenuItemTable Tests Headers appear and empty table renders correctly without buttons
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Average Rating
Received:
