[Killed] BlockStatement
main/components/MyReviews/ReviewForm.jsx:11:31
     return new Date().toISOString().slice(0, 16); // Default to now, in YYYY-MM-DDTHH:mm format
   });
 
-  const handleSubmit = (e) => {
-    e.preventDefault();
-    submitAction({
-      reviewerComments: comments,
-      itemsStars: stars,
-      dateItemServed: dateServed,
-    });
-  };
+  const handleSubmit = (e) => {};
 
   return (
killedBy: MyReviewsCreatePage - full coverage tests submits form and navigates on successful post
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ArrayDeclaration
main/components/MyReviews/ReviewForm.jsx:50:12
           value={stars}
           onChange={(e) => setStars(Number(e.target.value))}
         >
-          {[1, 2, 3, 4, 5].map((num) => (
+          {[].map((num) => (
             <option key={num} value={num}>
               {num}
killedBy: MyReviewsCreatePage - full coverage tests renders form fields with expected defaults
statusReason: expect(element).toHaveValue(5)

Expected the element to have value:
  5
Received:
  undefined
