[Killed] StringLiteral
main/components/Users/UsersTable.jsx:22:9
   },
   {
     Header: "Admin",
-    id: "admin",
+    id: "",
     accessor: (row, _rowIndex) => String(row.admin), // hack needed for boolean values to show up
   },
killedBy: UserTable tests Has the expected colum headers and content
statusReason: Unable to find an element by: [data-testid="UsersTable-cell-row-0-col-admin"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ArrowFunction
main/components/Users/UsersTable.jsx:28:15
   {
     Header: "Moderator",
     id: "moderator",
-    accessor: (row, _rowIndex) => String(row.moderator),
+    accessor: () => undefined,
   },
   {
killedBy: UserTable tests Has the expected colum headers and content
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  false
Received:

[Killed] StringLiteral
main/components/Users/UsersTable.jsx:31:13
     accessor: (row, _rowIndex) => String(row.moderator),
   },
   {
-    Header: "Alias",
+    Header: "",
     accessor: "alias",
   },
killedBy: UserTable tests Has the expected colum headers and content
statusReason: Unable to find an element with the text: Alias. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ObjectLiteral
main/components/Users/UsersTable.jsx:38:3
     Header: "Proposed Alias",
     accessor: "proposedAlias",
   },
-  {
-    Header: "Status",
-    accessor: (row) => {
-      if (row.status === "Approved" && row.dateApproved) {
-        // Parse as local date (YYYY-MM-DD)
-        const [year, month, day] = row.dateApproved.split("-");
-        const formattedDate = new Date(
-          year,
-          month - 1,
-          day,
-        ).toLocaleDateString();
-        return `Approved on ${formattedDate}`;
-      }
-      return row.status;
-    },
-  },
+  {},
 ];
 
killedBy: UserTable tests renders without crashing for empty table
statusReason: A column ID (or string accessor) is required!

[Killed] ConditionalExpression
main/components/Users/UsersTable.jsx:41:11
   {
     Header: "Status",
     accessor: (row) => {
-      if (row.status === "Approved" && row.dateApproved) {
+      if (true) {
         // Parse as local date (YYYY-MM-DD)
         const [year, month, day] = row.dateApproved.split("-");
killedBy: UserTable tests renders without crashing for three users
statusReason: Cannot read properties of null (reading 'split')
