[Killed] BlockStatement
main/pages/Reviews/EditReviewPage.jsx:4:42
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 import { useParams } from "react-router";
 
-export default function EditReviewPage() {
-  const { id } = useParams();
-
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Edit review with id {id}</h1>
-        <p>Coming soon!</p>
-      </div>
-    </BasicLayout>
-  );
-}
+export default function EditReviewPage() {}
 
killedBy: EditReviewPage tests renders without crashing
statusReason: Unable to find an element with the text: /Edit review with id/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>
