[Killed] StringLiteral
src/main/utils/Reviews.jsx:25:26
     params: {
       id: cell.row.original.id,
       status: status,
-      moderatorComments: "",
+      moderatorComments: "Stryker was here!",
     },
   };
killedBy: Reviews cellToAxiosParamsModerate It returns the correct params for APPROVED
statusReason: expected { url: '/api/reviews/moderate', …(2) } to deeply equal { url: '/api/reviews/moderate', …(2) }
