[Killed] ConditionalExpression
main/components/Moderation/ModerationModal.jsx:13:17
   onSubmit,
   review,
 }) {
-  const title = status === "APPROVED" ? "Approve Review" : "Reject Review";
+  const title = false ? "Approve Review" : "Reject Review";
   const actionText = status === "APPROVED" ? "Approve" : "Reject";
   const actionVerb = status === "APPROVED" ? "approving" : "rejecting";
killedBy: ReviewsTable tests opens moderation modal and submits approve review comments; ModerationModal tests renders approve modal with review details and disabled submit when comments are empty
statusReason: Unable to find an element with the text: Approve Review. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Killed] EqualityOperator
main/components/Moderation/ModerationModal.jsx:14:22
   review,
 }) {
   const title = status === "APPROVED" ? "Approve Review" : "Reject Review";
-  const actionText = status === "APPROVED" ? "Approve" : "Reject";
+  const actionText = status !== "APPROVED" ? "Approve" : "Reject";
   const actionVerb = status === "APPROVED" ? "approving" : "rejecting";
 
killedBy: ModerationModal tests renders approve and reject buttons with correct bootstrap variants
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Approve
Received:
  Reject

[Killed] ConditionalExpression
main/components/Moderation/ModerationModal.jsx:15:22
 }) {
   const title = status === "APPROVED" ? "Approve Review" : "Reject Review";
   const actionText = status === "APPROVED" ? "Approve" : "Reject";
-  const actionVerb = status === "APPROVED" ? "approving" : "rejecting";
+  const actionVerb = true ? "approving" : "rejecting";
 
   return (
killedBy: ModerationModal tests renders reject modal with comment input and calls submit callback
statusReason: Unable to find an element with the text: /Please add moderator comments before rejecting this review\./i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<div
  aria-modal="true"
  class="fade modal show"
  role="dialog"
  style="display: bloc
