[Killed] StringLiteral
main/components/MyReviews/ReviewForm.jsx:16:22
   initialStars = 5,
   initialDateServed,
   submitAction,
-  submitButtonText = "Submit Review",
+  submitButtonText = "",
 }) {
   const [comments, setComments] = React.useState(initialComments);
killedBy: MyReviewsCreatePage - full coverage tests submit button is enabled by default
statusReason: Unable to find role="button" and name `/submit review/i`

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
main/components/MyReviews/ReviewForm.jsx:24:19
     dateTimeLocalValue(initialDateServed),
   );
 
-  useEffect(() => {
-    setComments(initialComments);
-    setStars(initialStars);
-    if (initialDateServed) {
-      setDateServed(dateTimeLocalValue(initialDateServed));
-    }
-  }, [initialComments, initialDateServed, initialStars]);
+  useEffect(() => {}, [initialComments, initialDateServed, initialStars]);
 
   const handleSubmit = (e) => {
killedBy: ReviewForm tests updates form state when initial values change
statusReason: expect(element).toHaveValue(Updated from backend)

Expected the element to have value:
  Updated from backend
Received:
  Locally edited comment
