[Killed] BlockStatement
main/components/Statistics/CommonsAveragesOverTimeTable.jsx:7:4
 export default function CommonsAveragesOverTimeTable({
   rows,
   testIdPrefix = "CommonsAveragesOverTimeTable",
-}) {
-  const columns = [
-    {
-      Header: "Dining Commons",
-      accessor: "diningCommonsCode",
-    },
-    {
-      Header: "Month",
-      accessor: "period",
-    },
-    {
-      Header: "Average Score",
-      accessor: "averageStars",
-      Cell: ({ value }) => value.toFixed(2),
-    },
-    {
-      Header: "Reviews",
-      accessor: "reviewCount",
-    },
-  ];
-
-  return <OurTable data={rows} columns={columns} testid={testIdPrefix} />;
-}
+}) {}
 
killedBy: CommonsAveragesOverTimeTable tests renders all rows
statusReason: Unable to find an element by: [data-testid="CommonsAveragesOverTimeTable-cell-row-0-col-diningCommonsCode"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>
