[Killed] BlockStatement
main/components/Users/RoleEmailAddModal.jsx:28:19
 
   // Clear the form each time the modal opens or closes, so a previous
   // submission's value/errors don't linger.
-  useEffect(() => {
-    reset();
-  }, [show, reset]);
+  useEffect(() => {}, [show, reset]);
 
   const onSubmit = (data) => {
killedBy: AdminsIndexPage tests renders the list of admins and the cannot-delete note
statusReason: Unable to find an element by: [data-testid="AdminsIndexPage-cell-row-0-col-email"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] LogicalOperator
main/components/Users/RoleEmailAddModal.jsx:49:26
               data-testid={testIdPrefix + "-email"}
               id="email"
               type="text"
-              isInvalid={Boolean(errors.email) || Boolean(serverError)}
+              isInvalid={Boolean(errors.email) && Boolean(serverError)}
               {...register("email", {
                 required: "Email is required.",
killedBy: RoleEmailAddModal tests submitting a blank email shows a required error and does not call onSubmitEmail
statusReason: expect(element).toHaveClass("is-invalid")

Expected the element to have class:
  is-invalid
Received:
  form-control

[Killed] ConditionalExpression
main/components/Users/RoleEmailAddModal.jsx:49:26
               data-testid={testIdPrefix + "-email"}
               id="email"
               type="text"
-              isInvalid={Boolean(errors.email) || Boolean(serverError)}
+              isInvalid={false}
               {...register("email", {
                 required: "Email is required.",
killedBy: RoleEmailAddModal tests submitting a blank email shows a required error and does not call onSubmitEmail
statusReason: expect(element).toHaveClass("is-invalid")

Expected the element to have class:
  is-invalid
Received:
  form-control

[Killed] ConditionalExpression
main/components/Users/RoleEmailAddModal.jsx:59:12
               {errors.email && "A valid email is required."}
             </Form.Control.Feedback>
           </Form.Group>
-          {serverError && (
-            <div className="text-danger" data-testid={testIdPrefix + "-error"}>
-              {serverError}
-            </div>
-          )}
+          {true}
         </Modal.Body>
         <Modal.Footer>
killedBy: RoleEmailAddModal tests renders serverError text when provided
statusReason: Unable to find an element by: [data-testid="RoleEmailAddModal-error"]

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Killed] ConditionalExpression
main/components/Users/RoleEmailAddModal.jsx:59:12
               {errors.email && "A valid email is required."}
             </Form.Control.Feedback>
           </Form.Group>
-          {serverError && (
-            <div className="text-danger" data-testid={testIdPrefix + "-error"}>
-              {serverError}
-            </div>
-          )}
+          {false}
         </Modal.Body>
         <Modal.Footer>
killedBy: RoleEmailAddModal tests renders serverError text when provided
statusReason: Unable to find an element by: [data-testid="RoleEmailAddModal-error"]

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>
