[Killed] ArrowFunction
main/components/Users/RoleEmailTable.jsx:19:5
   const [pendingEmail, setPendingEmail] = useState(null);
 
   const deleteMutation = useBackendMutation(
-    (email) => ({
-      url: deleteEndpoint,
-      method: "DELETE",
-      params: { email },
-    }),
+    () => undefined,
     {
       onSuccess: (deleted) => {
killedBy: RoleEmailTable tests confirming delete calls the delete endpoint with the email and shows a toast
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class=""
    style=""

[Killed] StringLiteral
main/components/Users/RoleEmailTable.jsx:21:15
   const deleteMutation = useBackendMutation(
     (email) => ({
       url: deleteEndpoint,
-      method: "DELETE",
+      method: "",
       params: { email },
     }),
killedBy: ModeratorsIndexPage tests deleting a moderator refetches the moderator list; AdminsIndexPage tests deleting an admin refetches the admin list; RoleEmailTable tests confirming delete calls the delete endpoint with the email and shows a toast
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class=""
    style=""

[Killed] ObjectLiteral
main/components/Users/RoleEmailTable.jsx:22:15
     (email) => ({
       url: deleteEndpoint,
       method: "DELETE",
-      params: { email },
+      params: {},
     }),
     {
killedBy: RoleEmailTable tests confirming delete calls the delete endpoint with the email and shows a toast
statusReason: expected {} to deeply equal { email: 'admin1@ucsb.edu' }

[Killed] BlockStatement
main/components/Users/RoleEmailTable.jsx:25:31
       params: { email },
     }),
     {
-      onSuccess: (deleted) => {
-        toast(deleted?.message ?? "Deleted");
-      },
+      onSuccess: (deleted) => {},
     },
     // Stryker disable next-line ArrayDeclaration: invalidateQueries([]) invalidates every
killedBy: RoleEmailTable tests confirming delete calls the delete endpoint with the email and shows a toast
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] OptionalChaining
main/components/Users/RoleEmailTable.jsx:26:15
     }),
     {
       onSuccess: (deleted) => {
-        toast(deleted?.message ?? "Deleted");
+        toast(deleted.message ?? "Deleted");
       },
     },
killedBy: RoleEmailTable tests uses a default toast message when the response has no message
statusReason: expected "vi.fn()" to be called with arguments: [ 'Deleted' ]

Received: 

  1st vi.fn() call:

  [
-   "Deleted",

[Killed] BlockStatement
main/components/Users/RoleEmailTable.jsx:34:38
     [getEndpoint],
   );
 
-  const openDeleteModal = (email) => {
-    setPendingEmail(email);
-    setShowDeleteModal(true);
-  };
+  const openDeleteModal = (email) => {};
 
   const closeDeleteModal = () => {
killedBy: ModeratorsIndexPage tests deleting a moderator refetches the moderator list; AdminsIndexPage tests deleting an admin refetches the admin list; RoleEmailTable tests clicking Delete opens a confirmation modal; canceling does not delete
statusReason: Unable to find an element by: [data-testid="RoleEmailDeleteModal-confirm"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BooleanLiteral
main/components/Users/RoleEmailTable.jsx:40:24
   };
 
   const closeDeleteModal = () => {
-    setShowDeleteModal(false);
+    setShowDeleteModal(true);
     setPendingEmail(null);
   };
killedBy: RoleEmailTable tests clicking Delete opens a confirmation modal; canceling does not delete
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-dialog modal-dialog-centered"
  data-testid="RoleEmailDeleteModal"
>
  <div
    class="modal-content"

[Killed] StringLiteral
main/components/Users/RoleEmailTable.jsx:56:11
     },
     {
       Header: "Delete",
-      id: "delete",
+      id: "",
       Cell: (cell) => {
         if (cell.row.original.isInAdminEmails) {
killedBy: RoleEmailTable tests renders the Email and Delete column headers and content
statusReason: Unable to find an element by: [data-testid="RoleEmailTable-header-delete"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ConditionalExpression
main/components/Users/RoleEmailTable.jsx:58:13
       Header: "Delete",
       id: "delete",
       Cell: (cell) => {
-        if (cell.row.original.isInAdminEmails) {
+        if (true) {
           return (
             <span
killedBy: RoleEmailTable tests clicking Delete opens a confirmation modal; canceling does not delete
statusReason: Unable to find an element by: [data-testid="RoleEmailTable-cell-row-0-col-delete-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/Users/RoleEmailTable.jsx:71:26
           <Button
             className="btn btn-danger"
             onClick={() => openDeleteModal(cell.row.original.email)}
-            data-testid={`${testIdPrefix}-cell-row-${cell.row.index}-col-delete-button`}
+            data-testid={``}
           >
             Delete
killedBy: AdminsIndexPage tests deleting an admin refetches the admin list; RoleEmailTable tests clicking Delete opens a confirmation modal; canceling does not delete
statusReason: Unable to find an element by: [data-testid="AdminsIndexPage-cell-row-0-col-delete-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
