[Killed] BlockStatement
src/main/pages/HomePage.jsx:24:28
     setSelectedDate(newDate);
   };
   const queries = [];
-  if (Array.isArray(data)) {
-    for (const d of data) {
-      queries.push({
-        queryKey: ["meals", d.code, selectedDate],
-        queryFn: () =>
-          axios
-            .get(`/api/diningcommons/${selectedDate}/${d.code}`)
-            .then((res) => res.data),
-      });
-    }
-  }
+  if (Array.isArray(data)) {}
   const mealsOffered = useQueries(queries);
 
killedBy: HomePage meals offered today tests Query key must be 'meals'
statusReason: expected 0 to be greater than 0
