[Killed] MethodExpression
main/pages/MenuItem/MenuItemPage.jsx:28:12
 
   return (
     <BasicLayout>
-      <h2>{meal.at(0).toUpperCase() + meal.substring(1)}</h2>
+      <h2>{meal.at(0).toLowerCase() + meal.substring(1)}</h2>
       <MenuItemTable currentUser={currentUser} menuItems={menuItems} />
     </BasicLayout>
killedBy: MenuItemPage MenuItemPage works with no backend
statusReason: Unable to find an element with the text: Breakfast. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
