[Killed] UnaryOperator
main/pages/Reviews/EditReviewPage.jsx:39:16
         },
       );
       toast(`Review ${id} updated`);
-      navigate(-1);
+      navigate(+1);
     } catch (err) {
       let errorMessage = err.message;
killedBy: EditReviewPage tests submits edited review and navigates back on success
statusReason: expected "vi.fn()" to be called with arguments: [ -1 ]

Received: 

  1st vi.fn() call:

  [
-   -1,

[Killed] LogicalOperator
main/pages/Reviews/EditReviewPage.jsx:42:11
       navigate(-1);
     } catch (err) {
       let errorMessage = err.message;
-      if (err.response && err.response.data && err.response.data.error) {
+      if (err.response || err.response.data && err.response.data.error) {
         errorMessage = err.response.data.error;
       }
killedBy: EditReviewPage tests shows fallback error message when update fails without a response
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BooleanLiteral
main/pages/Reviews/EditReviewPage.jsx:53:21
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Review</h1>
-        {!review || !review.item ? (
+        {!review || review.item ? (
           <p>Loading review...</p>
         ) : (
killedBy: EditReviewPage tests loads the review into the edit form
statusReason: Unable to find a label with the text of: Item Name

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
