[Killed] StringLiteral
main/pages/Statistics/BestItemsPage.jsx:43:30
               <option
                 key={opt.value}
                 value={opt.value}
-                data-testid={`BestItemsPage-period-option-${opt.value}`}
+                data-testid={``}
               >
                 {opt.label}
killedBy: BestItemsPage tests renders an option for each period
statusReason: Unable to find an element by: [data-testid="BestItemsPage-period-option-ALL"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
