[Killed] StringLiteral
src/main/utils/Aliases.jsx:14:11
 });
 
 export const cellToAxiosParamsReject = (cell) => ({
-  method: "PUT",
+  method: "",
   url: "/api/currentUser/updateAliasModeration",
   params: {
killedBy: Aliases Utils cellToAxiosParamsReject returns the correct params for REJECTED
statusReason: expected { method: '', …(2) } to deeply equal { …(3) }
