[Killed] ObjectLiteral
src/main/utils/Reviews.jsx:26:13
   return {
     url: "/api/reviews/moderate",
     method: "PUT",
-    params: {
-      id: cell.row.original.id,
-      status: status,
-      moderatorComments: moderatorComments,
-    },
+    params: {},
   };
 }
killedBy: Reviews cellToAxiosParamsModerate It returns the correct params for APPROVED
statusReason: expected { url: '/api/reviews/moderate', …(2) } to deeply equal { url: '/api/reviews/moderate', …(2) }
