[Timeout] OptionalChaining
main/components/Nav/Footer.jsx:7:23
 export const space = " ";
 
 export default function Footer({ systemInfo }) {
-  const feedbackUrl = systemInfo?.appFeedbackUrl;
+  const feedbackUrl = systemInfo.appFeedbackUrl;
   const [showFeedbackModal, setShowFeedbackModal] = useState(false);
 

[Timeout] BooleanLiteral
main/components/Nav/Footer.jsx:8:62
 
 export default function Footer({ systemInfo }) {
   const feedbackUrl = systemInfo?.appFeedbackUrl;
-  const [showFeedbackModal, setShowFeedbackModal] = useState(false);
+  const [showFeedbackModal, setShowFeedbackModal] = useState(true);
 
   return (

[Timeout] StringLiteral
main/components/Nav/Footer.jsx:21:14
           rel="noopener noreferrer"
         >
           CMPSC 156
-        </a>{" "}
+        </a>{""}
         at{" "}
         <a

[Timeout] StringLiteral
main/components/Nav/Footer.jsx:50:11
         >
           here
         </a>
-        .{" "}
+        .{""}
         {feedbackUrl && (
           <>

[Killed] ArrowFunction
main/components/Nav/Footer.jsx:55:24
           <>
             <Button
               data-testid="footer-feedback-button"
-              onClick={() => setShowFeedbackModal(true)}
+              onClick={() => undefined}
               variant="primary"
             >
killedBy: Footer tests Feedback button is shown when systemInfo.appFeedbackUrl is defined, and opens the feedback modal
statusReason: Unable to find an element with the text: /Users with a UCSB Google Account are welcome/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <footer
      class="bg-light pt-3 pt-md-4 pb-4 pb-md-5"
      data-testid="Footer"

[Killed] BooleanLiteral
main/components/Nav/Footer.jsx:55:51
           <>
             <Button
               data-testid="footer-feedback-button"
-              onClick={() => setShowFeedbackModal(true)}
+              onClick={() => setShowFeedbackModal(false)}
               variant="primary"
             >
killedBy: Footer tests Feedback button is shown when systemInfo.appFeedbackUrl is defined, and opens the feedback modal
statusReason: Unable to find an element with the text: /Users with a UCSB Google Account are welcome/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <footer
      class="bg-light pt-3 pt-md-4 pb-4 pb-md-5"
      data-testid="Footer"

[Killed] ArrowFunction
main/components/Nav/Footer.jsx:62:23
             </Button>
             <Modal
               show={showFeedbackModal}
-              onHide={() => setShowFeedbackModal(false)}
+              onHide={() => undefined}
               animation={false}
               data-testid="footer-feedback-modal"
killedBy: Footer tests Feedback modal closes when the modal onHide is triggered
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <a
  class="btn btn-primary"
  data-testid="footer-feedback-modal-link"
  href="https://docs.google.com/forms/example"
  rel="noopener noreferrer"
  role="button"

[Killed] BooleanLiteral
main/components/Nav/Footer.jsx:63:26
             <Modal
               show={showFeedbackModal}
               onHide={() => setShowFeedbackModal(false)}
-              animation={false}
+              animation={true}
               data-testid="footer-feedback-modal"
             >
killedBy: Footer tests Feedback modal closes when the Cancel button is clicked
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <a
  class="btn btn-primary"
  data-testid="footer-feedback-modal-link"
  href="https://docs.google.com/forms/example"
  rel="noopener noreferrer"
  role="button"

[Killed] ArrowFunction
main/components/Nav/Footer.jsx:81:28
               <Modal.Footer>
                 <Button
                   variant="secondary"
-                  onClick={() => setShowFeedbackModal(false)}
+                  onClick={() => undefined}
                   data-testid="footer-feedback-modal-close-button"
                 >
killedBy: Footer tests Feedback modal closes when the Cancel button is clicked
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <a
  class="btn btn-primary"
  data-testid="footer-feedback-modal-link"
  href="https://docs.google.com/forms/example"
  rel="noopener noreferrer"
  role="button"

[Killed] ArrowFunction
main/components/Nav/Footer.jsx:93:28
                   rel="noopener noreferrer"
                   target="_blank"
                   variant="primary"
-                  onClick={() => setShowFeedbackModal(false)}
+                  onClick={() => undefined}
                 >
                   Open Feedback Form
killedBy: Footer tests Feedback modal closes when the Open Feedback Form button is clicked
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <a
  class="btn btn-primary"
  data-testid="footer-feedback-modal-link"
  href="https://docs.google.com/forms/example"
  rel="noopener noreferrer"
  role="button"
