[Killed] StringLiteral
main/components/Reviews/ReviewsTable.jsx:140:56
       ButtonColumn("Approve", "primary", approveCallback, "Reviewstable"),
     );
     columns.push(
-      ButtonColumn("Reject", "danger", rejectCallback, "Reviewstable"),
+      ButtonColumn("Reject", "danger", rejectCallback, ""),
     );
   }
killedBy: ModerateReviews Page Tests renders reviews with approve/reject buttons for moderator; ReviewsTable tests Moderator buttons appear and work properly
statusReason: Unable to find an element by: [data-testid="Reviewstable-cell-row-1-col-Reject-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
