[Killed] BlockStatement
main/components/Users/RoleEmailAddModal.jsx:32:30
     reset();
   }, [show, reset]);
 
-  const onSubmit = (data) => {
-    onSubmitEmail(data.email);
-  };
+  const onSubmit = (data) => {};
 
   return (
killedBy: AdminsIndexPage tests clicking Add Admin opens the modal, and a successful post shows a toast and closes it; RoleEmailAddModal tests submitting a valid email calls onSubmitEmail with that email
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] StringLiteral
main/components/Users/RoleEmailAddModal.jsx:50:28
               id="email"
               type="text"
               isInvalid={Boolean(errors.email) || Boolean(serverError)}
-              {...register("email", {
+              {...register("", {
                 required: "Email is required.",
                 pattern: emailRegex,
killedBy: RoleEmailAddModal tests renders title and button label
statusReason: Cannot read properties of undefined (reading '_f')

[Killed] LogicalOperator
main/components/Users/RoleEmailAddModal.jsx:59:12
               {errors.email && "A valid email is required."}
             </Form.Control.Feedback>
           </Form.Group>
-          {serverError && (
-            <div className="text-danger" data-testid={testIdPrefix + "-error"}>
-              {serverError}
-            </div>
-          )}
+          {serverError || <div className="text-danger" data-testid={testIdPrefix + "-error"}>
+              {serverError}
+            </div>}
         </Modal.Body>
         <Modal.Footer>
killedBy: RoleEmailAddModal tests renders serverError text when provided
statusReason: Unable to find an element by: [data-testid="RoleEmailAddModal-error"]

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Killed] StringLiteral
main/components/Users/RoleEmailAddModal.jsx:69:41
           <Button
             variant="secondary"
             onClick={onHide}
-            data-testid={testIdPrefix + "-cancel"}
+            data-testid={testIdPrefix + ""}
           >
             Cancel
killedBy: AdminsIndexPage tests clicking Add Admin opens the modal, and a successful post shows a toast and closes it; RoleEmailAddModal tests clicking cancel calls onHide
statusReason: Found multiple elements by: [data-testid="RoleEmailAddModal"]

Here are the matching elements:

Ignored nodes: comments, script, style
<div
  class="modal-dialog modal-dialog-centered"
  data-testid="RoleEmailAddModal"
