[Killed] ObjectLiteral
main/components/Users/RoleEmailTable.jsx:19:17
   const [pendingEmail, setPendingEmail] = useState(null);
 
   const deleteMutation = useBackendMutation(
-    (email) => ({
-      url: deleteEndpoint,
-      method: "DELETE",
-      params: { email },
-    }),
+    (email) => ({}),
     {
       onSuccess: (deleted) => {
killedBy: ModeratorsIndexPage tests deleting a moderator refetches the moderator list; AdminsIndexPage tests deleting an admin refetches the admin list; RoleEmailTable tests confirming delete calls the delete endpoint with the email and shows a toast
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class=""
    style=""

[Killed] LogicalOperator
main/components/Users/RoleEmailTable.jsx:26:15
     }),
     {
       onSuccess: (deleted) => {
-        toast(deleted?.message ?? "Deleted");
+        toast(deleted?.message && "Deleted");
       },
     },
killedBy: RoleEmailTable tests confirming delete calls the delete endpoint with the email and shows a toast
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "Admin with id admin1@ucsb.edu deleted",

[Killed] BlockStatement
main/components/Users/RoleEmailTable.jsx:39:34
     setShowDeleteModal(true);
   };
 
-  const closeDeleteModal = () => {
-    setShowDeleteModal(false);
-    setPendingEmail(null);
-  };
+  const closeDeleteModal = () => {};
 
   const confirmDelete = () => {
killedBy: RoleEmailTable tests clicking Delete opens a confirmation modal; canceling does not delete
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-dialog modal-dialog-centered"
  data-testid="RoleEmailDeleteModal"
>
  <div
    class="modal-content"

[Killed] ConditionalExpression
main/components/Users/RoleEmailTable.jsx:58:13
       Header: "Delete",
       id: "delete",
       Cell: (cell) => {
-        if (cell.row.original.isInAdminEmails) {
+        if (false) {
           return (
             <span
killedBy: RoleEmailTable tests rows with isInAdminEmails=true show the cannot-delete indicator instead of a Delete button
statusReason: Unable to find an element by: [data-testid="RoleEmailTable-cell-row-2-cannot-delete"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ArrowFunction
main/components/Users/RoleEmailTable.jsx:70:22
         return (
           <Button
             className="btn btn-danger"
-            onClick={() => openDeleteModal(cell.row.original.email)}
+            onClick={() => undefined}
             data-testid={`${testIdPrefix}-cell-row-${cell.row.index}-col-delete-button`}
           >
killedBy: ModeratorsIndexPage tests renders the list of moderators
statusReason: Unable to find an element by: [data-testid="ModeratorsIndexPage-cell-row-0-col-email"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
