[Killed] BlockStatement
main/pages/Meal/MealTimesPage.jsx:29:23
     navigate(`/diningcommons/${newDate}/${diningCommonsCode}`);
   };
 
-  if (status === 204) {
-    const message = `${diningCommonsCode} is closed on ${dateTime}. Please select another date or dining common.`;
-    toast(message, { toastId: "closed-dining-commons" });
-    return (
-      <BasicLayout>
-        <h1>
-          Meals at {diningCommonsCode} for {dateTime}
-        </h1>
-        <p>
-          <label htmlFor="dateSelector">Select Date:</label>
-          <br></br>
-          <input
-            type="date"
-            id="dateSelector"
-            name="dateSelector"
-            value={selectedDate}
-            onChange={onChangeDate}
-          />
-        </p>
-      </BasicLayout>
-    );
-  }
+  if (status === 204) {}
 
   return (
killedBy: MealTimesPage tests when backend returns 204, displays toast message
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />
