[Killed] LogicalOperator
main/pages/Reviews/EditReviewPage.jsx:42:11
       navigate(-1);
     } catch (err) {
       let errorMessage = err.message;
-      if (err.response && err.response.data && err.response.data.error) {
+      if (err.response && err.response.data || err.response.data.error) {
         errorMessage = err.response.data.error;
       }
killedBy: EditReviewPage tests shows fallback error message when update fails without an error field
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "Error updating review: Request failed with status code 500",

[Killed] ConditionalExpression
main/pages/Reviews/EditReviewPage.jsx:42:11
       navigate(-1);
     } catch (err) {
       let errorMessage = err.message;
-      if (err.response && err.response.data && err.response.data.error) {
+      if (true) {
         errorMessage = err.response.data.error;
       }
killedBy: EditReviewPage tests shows fallback error message when update fails without an error field
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "Error updating review: Request failed with status code 500",

[Killed] BooleanLiteral
main/pages/Reviews/EditReviewPage.jsx:53:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Review</h1>
-        {!review || !review.item ? (
+        {review || !review.item ? (
           <p>Loading review...</p>
         ) : (
killedBy: EditReviewPage tests loads the review into the edit form
statusReason: Cannot read properties of undefined (reading 'item')

[Killed] ConditionalExpression
main/pages/Reviews/EditReviewPage.jsx:53:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Review</h1>
-        {!review || !review.item ? (
+        {true ? (
           <p>Loading review...</p>
         ) : (
killedBy: EditReviewPage tests loads the review into the edit form
statusReason: Unable to find a label with the text of: Item Name

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
