[Killed] ArrowFunction
main/components/DiningCommons/DiningCommonsTable.jsx:27:27
           <div>
             {!value || value.length === 0
               ? "No meals offered today"
-              : value.map((meal) => (
-                  <Link
-                    key={meal.code}
-                    to={`/diningcommons/${date}/${row.original.code}/${meal.code}`}
-                    className="p-2"
-                    data-testid={`DiningCommonsTable-cell-row-${row.index}-col-meal-${meal.code}`}
-                  >
-                    {meal.name}
-                  </Link>
-                ))}
+              : value.map(() => undefined)}
           </div>
         );
killedBy: DiningCommonsTable tests Meals Offered Today renders meal links correctly when there are meals offered
statusReason: Unable to find an element with the text: Breakfast. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
