[Killed] BooleanLiteral
main/components/Moderation/ModerationModal.jsx:50:21
         <Button
           variant={status === "APPROVED" ? "primary" : "danger"}
           onClick={onSubmit}
-          disabled={!moderatorComments.trim()}
+          disabled={moderatorComments.trim()}
           data-testid="moderation-modal-submit"
         >
killedBy: ModerationModal tests renders approve modal with review details and disabled submit when comments are empty
statusReason: expect(element).toBeDisabled()

Received element is not disabled:
  <button
  class="btn btn-primary"
  data-testid="moderation-modal-submit"
  type="button"
/>
