[Killed] BlockStatement
main/components/Users/UsersTable.jsx:67:38
   {
     Header: "Status",
     accessor: (row) => {
-      if (row.status === "APPROVED") {
-        const formattedDate = formatApprovalDate(row.dateApproved);
-        if (!formattedDate) {
-          return row.status;
-        }
-        return `Approved on ${formattedDate}`;
-      }
+      if (row.status === "APPROVED") {}
       return row.status;
     },
killedBy: UserTable tests Status column appends approval date only for approved users with a valid date
statusReason: Unable to find an element with the text: Approved on 10/31/2024. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] BlockStatement
main/components/Users/UsersTable.jsx:69:29
     accessor: (row) => {
       if (row.status === "APPROVED") {
         const formattedDate = formatApprovalDate(row.dateApproved);
-        if (!formattedDate) {
-          return row.status;
-        }
+        if (!formattedDate) {}
         return `Approved on ${formattedDate}`;
       }
killedBy: UserTable tests Status column appends approval date only for approved users with a valid date
statusReason: Unable to find an element with the text: APPROVED. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
