[Killed] StringLiteral
main/pages/Statistics/CommonsAveragesOverTimePage.jsx:11:12
     ["/api/statistics/commons/averages/overtime"],
     {
       method: "GET",
-      url: "/api/statistics/commons/averages/overtime",
+      url: "",
     },
     [],
killedBy: CommonsAveragesOverTimePage tests renders the table with rows
statusReason: Unable to find an element by: [data-testid="CommonsAveragesOverTimePage-table-cell-row-0-col-period"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
