[Killed] ConditionalExpression
main/pages/Statistics/CommonsAveragesPage.jsx:20:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Dining Commons Averages</h1>
-        {averages && averages.length === 0 ? (
+        {true ? (
           <p data-testid="CommonsAveragesPage-empty">
             No reviews available yet.
killedBy: CommonsAveragesPage tests renders the table with averages
statusReason: Unable to find an element by: [data-testid="CommonsAveragesPage-table-cell-row-0-col-diningCommonsCode"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
