[Killed] StringLiteral
src/main/utils/Aliases.jsx:24:15
 });
 
 export function onModerateSuccess() {
-  console.log("Moderation success");
+  console.log("");
   toast("Moderation success");
 }
killedBy: Aliases Utils onModerateSuccess It puts the message on console.log and in a toast
statusReason: expected "log" to be called with arguments: [ 'Moderation success' ]

Received: 

  1st log call:

  [
-   "Moderation success",
